Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_data/getstarted-videos.yaml.po
Languages: es_es

source: Videos
es_es: Vídeos

source: November 19, 2019
es_es: 19 de noviembre de 2019

source: Use Quarkus to build a Kafka Streams Application.
es_es: Utilice Quarkus para construir una aplicación de Kafka Streams.

source: Kafka Streams with Quarkus
es_es: Kafka Streams con Quarkus

source: December 6, 2019
es_es: 6 de diciembre de 2019

source: Create a microservice using your favorite Spring API.
es_es: Cree un microservicio utilizando su API de Spring favorita.

source: Kubernetes-native Spring Apps on Quarkus
es_es: Aplicaciones Spring nativas de Kubernetes en Quarkus

source: May 2, 2019
es_es: 2 de mayo de 2019

source: Build and deploy a native Quarkus application to Kubernetes.
es_es: Construir y desplegar una aplicación nativa de Quarkus en Kubernetes.

source: Quarkus on Kubernetes
es_es: Quarkus en Kubernetes

source: September 24, 2019
es_es: 24 de septiembre de 2019

source: Learn Quarkus basics by standing up a straightforward application serving a hello endpoint.
es_es: Aprenda los fundamentos de Quarkus poniendo en marcha una aplicación sencilla que sirva a un endpoint de hola.

source: Visual Studio Code Extension For Quarkus
es_es: Extensión de código de Visual Studio para Quarkus
