Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_versions/3.27/guides/appcds.adoc.po
Languages: es_es

source: This reference guide explains how to enable Application Class Data Sharing in your Quarkus applications.
es_es: Esta guía de referencia explica cómo habilitar Application Class Data Sharing en sus aplicaciones Quarkus.

source: What is Application Class Data Sharing (AppCDS)?
es_es: ¿Qué es el uso compartido de datos de clases de aplicaciones (AppCDS)?

source: link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[Application Class Data Sharing] is a JVM feature that helps reduce the startup time and memory footprint of a JVM application. This is achieved by having the JVM create a pre-processed shared archived of classes that are loaded at startup time. As these classes are loaded every time the application starts, AppCDS is a conceptually simple way of improving the application startup time, without the application itself having to be coded or configured in a specific way. How much of an improvement depends on many factors, such as the number of classes loaded, the underlying hardware etc.
es_es: La link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[compartición de datos de clases de aplicación] es una característica de la JVM que ayuda a reducir el tiempo de arranque y la huella de memoria de una aplicación JVM. Esto se consigue haciendo que la JVM cree un archivo compartido preprocesado de clases que se cargan en el momento del arranque. Como estas clases se cargan cada vez que se inicia la aplicación, AppCDS es una forma conceptualmente sencilla de mejorar el tiempo de inicio de la aplicación, sin que la propia aplicación tenga que codificarse o configurarse de una forma específica. El grado de mejora depende de muchos factores, como el número de clases cargadas, el hardware subyacente, etc.

source: Vanilla AppCDS generation
es_es: Generación de AppCDS Vanilla

source: The main downside of creating AppCDS manually for an application is that their generation requires launching the application with special flags and obtaining the archive in a step before the application is deployed to production.
es_es: El principal inconveniente de crear AppCDS manualmente para una aplicación es que su generación requiere lanzar la aplicación con banderas especiales y obtener el archivo en un paso previo al despliegue de la aplicación en producción.

source: The exact process depends on the JVM version being used as newer JVM have incrementally made the process easier.
es_es: El proceso exacto depende de la versión de JVM que se utilice, ya que las nuevas JVM han ido facilitando el proceso.

source: AppCDS in Quarkus
es_es: AppCDS en Quarkus

source: Creating the archive
es_es: Creación del archivo

source: Quarkus makes AppCDS generation as simple as setting the `quarkus.package.jar.appcds.enabled` configuration property to `true`. For an example Quarkus application using Maven (assuming it is located in `/tmp/code-with-quarkus`), the AppCDS archive can be generated by simply building the application like so:
es_es: Quarkus hace que la generación de AppCDS sea tan sencilla como establecer la propiedad de configuración `quarkus.package.jar.appcds.enabled` en `true`. Para una aplicación Quarkus de ejemplo que utilice Maven (suponiendo que esté ubicada en `/tmp/code-with-quarkus`), el archivo AppCDS puede generarse simplemente construyendo la aplicación de la siguiente manera:

source: When the build completes, the output will contain (among other things) the following:
es_es: Cuando finalice la compilación, la salida contendrá (entre otras cosas) lo siguiente:

source: If we take a look at `/tmp/code-with-quarkus/target/quarkus-app`, among the other files, we see `app-cds.jsa`, which is the generated AppCDS archive.
es_es: Si echamos un vistazo a `/tmp/code-with-quarkus/target/quarkus-app`, entre los otros archivos, vemos `app-cds.jsa`, que es el archivo AppCDS generado.

source: Using the archive
es_es: Utilización del archivo

source: Using the archive is done by using the `-XX:SharedArchiveFile` flag. However, a few caveats apply:
es_es: El uso del archivo se realiza mediante la bandera `-XX:SharedArchiveFile`. Sin embargo, se aplican algunas advertencias:

source: The paths to the Quarkus jar file and the AppCDS archive need to be exactly the same as those Quarkus used to build the archive
es_es: Las rutas de acceso al archivo jar de Quarkus y al archivo AppCDS deben ser exactamente las mismas que las utilizadas por Quarkus para crear el archivo.

source: The version of the JVM used to run the application must be **exactly** the same as the one used to build the Quarkus application.
es_es: La versión de la JVM utilizada para ejecutar la aplicación debe ser *exactamente* la misma que la utilizada para construir la aplicación Quarkus.

source: Assuming we are using the same JVM to run the application as we used to build the application, we can launch the application like so:
es_es: Asumiendo que estamos usando la misma JVM para ejecutar la aplicación que la que usamos para construir la aplicación, podemos lanzar la aplicación así:

source: The JVM is resilient. Faced with a situation where the archive file is not usable (for whatever reason) it will simply disable the AppCDS feature.
es_es: La JVM es resistente. Enfrentada a una situación en la que el fichero de archivo no es utilizable (por la razón que sea), simplemente desactivará la función AppCDS.

source: If it is desirable to simply halt the execution when the archive is not usable, the following command line invocation can be used:
es_es: Si se desea simplemente detener la ejecución cuando el archivo no es utilizable, se puede utilizar la siguiente invocación de línea de comandos:

source: Given what was mentioned above about how the application needs to be launched in order for the archive to be built, the question arises of how Quarkus deals with this situation.
es_es: Dado lo que se mencionó anteriormente acerca de cómo la aplicación necesita ser lanzada para que el archivo sea construido, surge la pregunta de cómo Quarkus se ocupa de esta situación.

source: The answer is that at application build time, right after the application archive is built, Quarkus launches the application, but only the parts of the launch process that are safe are run. More specifically, the application is run up until the steps that actually open sockets or run application logic.
es_es: La respuesta es que en el momento de construir la aplicación, justo después de construir el archivo de la aplicación, Quarkus lanza la aplicación, pero sólo se ejecutan las partes del proceso de lanzamiento que son seguras. Más concretamente, la aplicación se ejecuta hasta los pasos que realmente abren sockets o ejecutan la lógica de la aplicación.

source: This results in an archive generation process that on one hand is completely safe, but on the other hand is unable to archive every single class that the application might need at boot time. As a result, users are expected to get a slightly more effective archive if they manually go through the hoops of generating the AppCDS archive.
es_es: El resultado es un proceso de generación de archivos que, por un lado, es completamente seguro, pero por otro lado, es incapaz de archivar todas y cada una de las clases que la aplicación pueda necesitar en el momento del arranque. Como resultado, se espera que los usuarios obtengan un archivo ligeramente más eficaz si pasan manualmente por el aro de la generación del archivo AppCDS.

source: AppCDS has improved significantly in the latest JDK releases. This means that to ensure the best possible improvements from it, make sure your projects targets the highest possible Java version (ideally 17 or 21).
es_es: AppCDS ha mejorado significativamente en las últimas versiones del JDK. Esto significa que, para garantizar las mejores mejoras posibles, asegúrese de que sus proyectos se dirigen a la versión de Java más alta posible (idealmente 17 o 21).

source: Usage in containers
es_es: Uso en contenedores

source: When building container images using the `quarkus-container-image-jib` extension, Quarkus automatically takes care of all the steps needed to generate the archive and make it usable at runtime in the container.
es_es: Cuando se construyen imágenes de contenedor utilizando la extensión `quarkus-container-image-jib`, Quarkus se encarga automáticamente de todos los pasos necesarios para generar el archivo y hacerlo utilizable en tiempo de ejecución en el contenedor.
