Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_includes/developer-joy.html.po
Languages: es_es

source: Quarkus is not just about being great for writing Web Applications or Micro-Services. We’re focusing on more than the feature set: we make sure that every feature works well, simply, with little to no configuration, in the most intuitive way possible. It should be trivial to develop simple things, and easy to develop the more complex ones.
es_es: Quarkus no se trata sólo de ser genial para escribir Aplicaciones Web o Micro-Servicios. Nos centramos en algo más que el conjunto de características: nos aseguramos de que cada característica funcione bien, simplemente, con poca o ninguna configuración, de la manera más intuitiva posible. Debería ser trivial desarrollar cosas simples, y fácil desarrollar las más complejas.

source: Live Coding
es_es: Codificación en vivo

source: Improve and expedite the inner loop development process with live coding where code changes are automatically reflected in your running application. code -> refresh browser -> repeat
es_es: Mejore y agilice el proceso de desarrollo interno con la codificación en vivo, donde los cambios de código se reflejan automáticamente en su aplicación en ejecución. código → actualizar navegador → repetir

source: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode/">Read the Dev Mode guide</a>
es_es: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode/">Lee la guía del modo desarrollador</a>

source: Unified Config
es_es: Configuración unificada

source: Gone are the days of a thousand configuration files and formats. A single configuration file is all it takes for Quarkus applications to configure every single extension.
es_es: Atrás quedaron los días de mil archivos y formatos de configuración. Un solo archivo de configuración es todo lo que necesitan las aplicaciones de Quarkus para configurar cada una de las extensiones.

source: Quarkus focuses on the simplest and most useful way to use a given feature, trimming it to its most useful essence. This includes upfront analysis on how to best use a feature and guiding you in what we think is the best way to do things.
es_es: Quarkus se centra en la forma más sencilla y útil de utilizar una determinada función, reduciéndola a su esencia más útil. Esto incluye un análisis previo sobre la mejor manera de utilizar una característica y guiarle en lo que creemos que es la mejor manera de hacer las cosas.

source: Dev UI
es_es: Interfaz de usuario

source: Visualize and configure extensions as well as access to application logs and testing components
es_es: Visualizar y configurar las extensiones, así como acceder a los registros de la aplicación y a los componentes de prueba

source: <a href="{{site.baseurl}}/guides/dev-ui">Read the Dev UI guide</a>
es_es: <a href="{{site.baseurl}}/guides/dev-ui">Lee la guía de la interfaz de usuario de desarrollo</a>

source: Dev Services
es_es: Servicios de desarrollo

source: Automatic provisioning and application wiring of supporting services such as databases, identity servers, and more.
es_es: Aprovisionamiento automático y cableado de aplicaciones de servicios de apoyo como bases de datos, servidores de identidad, etc.

source: <a href="{{site.baseurl}}/guides/dev-services">Read the Dev Services guide</a>
es_es: <a href="{{site.baseurl}}/guides/dev-services">Lea la guía de servicios de desarrollo</a>

source: Continuous Testing
es_es: Pruebas continuas

source: Get instant feedback on code changes as tests run in the background on impacted code.
es_es: Obtenga información instantánea sobre los cambios en el código mientras las pruebas se ejecutan en segundo plano sobre el código afectado.

source: <a href="{{site.baseurl}}/guides/continuous-testing">Read the Continuous Testing guide</a>
es_es: <a href="{{site.baseurl}}/guides/continuous-testing">Lea la guía de Pruebas continuas</a>

source: Command Line Interface
es_es: Interfaz de línea de comandos

source: Create projects, manage extensions, and execute essential build and dev commands.
es_es: Cree proyectos, gestione extensiones y ejecute comandos esenciales de construcción y desarrollo.

source: <a href="{{site.baseurl}}/guides/cli-tooling">Read the CLI Tooling guide</a>
es_es: <a href="{{site.baseurl}}/guides/cli-tooling">Lee la guía de CLI Tooling</a>

source: Remote Development
es_es: Desarrollo a distancia

source: Run <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">dev mode</a> remotely with changes to local files immediately available in a containerize environment.
es_es: Ejecutar <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">modo dev</a> de forma remota con los cambios en los archivos locales inmediatamente disponibles en un entorno de contenedores.

source: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Read the Remote Development Mode guide</a>
es_es: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Lee la guía del modo de desarrollo remoto</a>
