Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_includes/get-started-code-steps.html.po
Languages: es_es

source: Step <span class="step-no">1</span>
es_es: Paso<span class="step-no">1</span>

source: Install via Command Line Interface
es_es: Instalar mediante la interfaz de línea de comando

source: Open your favorite terminal and use JBang to install the Quarkus CLI. You do not need to have Java installed first.
es_es: Abre tu terminal favorito y usa JBang para instalar Quarkus CLI. No necesitas tener Java instalado primero.

source: For Linux, macOS, and Windows (using WSL or bash compatible shell like Cygwin or MinGW)
es_es: Para Linux, macOS y Windows (use WSL o un shell compatible con bash como Cygwin o MinGW

source: For Windows using Powershell
es_es: Usar Powershell para Windows

source: Or, you can also install the CLI with SDKMAN!
es_es: O también puedes instalar la CLI con SDKMAN!

source: For more options, such as Homebrew or Chocolatey, see <a href="/guides/cli-tooling">the Quarkus CLI guide</a>.
es_es: Para más opciones, como Homebrew o Chocolatey，consulte<a href="/guides/cli-tooling">la guía CLI de Quarkus</a>。

source: Step <span class="step-no">2</span>
es_es: Paso<span class="step-no">2</span>

source: Create the Getting Started Application
es_es: Crear la aplicación de introducción

source: Run this script in your CLI:
es_es: Ejecute este script en su CLI:

source: Step <span class="step-no">3</span>
es_es: Paso<span class="step-no">3</span>

source: Run the Getting Started Application
es_es: Ejecutar la aplicación de introducción

source: Boom! Your Quarkus app is now running at <code>localhost:8080</code>
es_es: ¡Boom! Tu aplicación Quarkus ahora se está ejecutando en <code>localhost:8080</code>

source: Step <span class="step-no">4</span>
es_es: Paso<span class="step-no">4</span>

source: Live Coding with Quarkus
es_es: Codificación en tiempo real usando Quarkus

source: Cool stuff right? <a href="https://quarkus.io/guides/maven-tooling#dev-mode">Learn more about Quarkus's dev mode</a>.
es_es: ¿Cosas interesantes, verdad?<a href="https://quarkus.io/guides/maven-tooling#dev-mode">Obtén más información sobre el modo de desarrollo de Quarkus</a>
