Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_includes/header-navigation_full.html.po
Languages: es_es

source: <span href="{{site.baseurl}}/about/">About <i class="fas fa-chevron-down"></i></span>
es_es: <span href="{{site.baseurl}}/about/">Acerca de <i class="fas fa-chevron-down"></i></span>

source: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">WHAT IS QUARKUS?</a>
es_es: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">Â¿QUE ES QUARKUS?</a>

source: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTAINER FIRST</a>
es_es: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTENEDOR PRIMERO</a>

source: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">REACTIVE</a>
es_es: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">REACTIVO</a>

source: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">DEVELOPER JOY</a>
es_es: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">SATISFACCION DEL DESARROLLADOR</a>

source: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">STANDARDS</a>
es_es: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">ESTANDARES</a>

source: <span href="{{site.baseurl}}/learn/">Learn <i class="fas fa-chevron-down"></i></span>
es_es: <span href="{{site.baseurl}}/learn/">Aprende <i class="fas fa-chevron-down"></i></span>

source: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">GET STARTED</a>
es_es: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">EMPEZAR</a>

source: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">GUIDES</a>
es_es: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">GUIAS</a>

source: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">BOOKS</a>
es_es: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">LIBROS</a>

source: <span href="{{site.baseurl}}/learn/">Extensions <i class="fas fa-chevron-down"></i></span>
es_es: <span href="{{site.baseurl}}/learn/">Extensiones <i class="fas fa-chevron-down"></i></span>

source: <a href="{{site.baseurl}}/catalog" class="{% if page.url contains '/catalog/' %}active{% endif %}">EXTENSION CATALOG</a>
es_es: <a href="{{site.baseurl}}/catalog" class="{% if page.url contains '/catalog/' %}active{% endif %}">CATALOGO DE EXTENSIONES</a>

source: <a href="{{site.baseurl}}/useextensions" class="{% if page.url contains '/useextensions/' %}active{% endif %}">USE EXTENSIONS</a>
es_es: <a href="{{site.baseurl}}/useextensions" class="{% if page.url contains '/useextensions/' %}active{% endif %}">USO DE EXTENSIONES</a>

source: <a href="{{site.baseurl}}/createextensions" class="{% if page.url contains '/createextensions/' %}active{% endif %}">CREATE EXTENSIONS</a>
es_es: <a href="{{site.baseurl}}/createextensions" class="{% if page.url contains '/createextensions/' %}active{% endif %}">CREAR EXTENSIONES</a>

source: <span href="{{site.baseurl}}/learn/">Community <i class="fas fa-chevron-down"></i></span>
es_es: <span href="{{site.baseurl}}/learn/">Comunidad <i class="fas fa-chevron-down"></i></span>

source: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SUPPORT</a>
es_es: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SOPORTE</a>

source: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSSION</a>
es_es: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSIONES</a>

source: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTS</a>
es_es: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTOS</a>

source: <a href="{{site.baseurl}}/publications" class="{% if page.url contains '/publications/' %}active{% endif %}">PUBLICATIONS</a>
es_es: <a href="{{site.baseurl}}/publications" class="{% if page.url contains '/publications/' %}active{% endif %}">PUBLICACIONES</a>

source: <a href="{{site.baseurl}}/awards" class="{% if page.url contains '/awards/' %}active{% endif %}">AWARDS</a>
es_es: <a href="{{site.baseurl}}/awards" class="{% if page.url contains '/awards/' %}active{% endif %}">PREMIOS</a>

source: <a href="https://code.quarkus.io" class="button-cta secondary white">Start Coding</a>
es_es: <a href="https://code.quarkus.io" class="button-cta secondary white">Empezar a codificar</a>
