Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_includes/worldtour-abstracts.html.po
Languages: es_es

source: These materials are for JUGs who have tour dates booked and want access to promotional materials to use to create excitement and drum up attendance. We've written a couple versions of the session abstracts so you could find one that fits your JUGs personality, or go for it and create your own! We've also created some <a href="{{site.baseurl}}/worldtour/graphics">graphic resources</a> for social promotions a well.
es_es: Estos materiales son para los JUGs que tienen fechas reservadas y quieren tener acceso a materiales promocionales para crear expectación y aumentar la asistencia. Hemos redactado un par de versiones de los resúmenes de las sesiones para que encuentres la que mejor se adapte a la personalidad de tu JUG, ¡o crea la tuya propia! También hemos creado algunos <a href="{{site.baseurl}}/worldtour/graphics">recursos gráficos</a> para promociones sociales.

source: Session Abstracts
es_es: Resúmenes de las sesiones

source: Abstract A - All Rock'n Roll and Big Drum Solos
es_es: Resumen A - Todo Rock'n Roll y Grandes Solos de Batería

source: In the spirit of the times, the Quarkus Team virtually presents a big, loud, and bold, rock & roll mega-stadium tour.
es_es: Con el espíritu de los tiempos que corren, el equipo Quarkus presenta virtualmente una mega-gira de rock & roll grande, ruidosa y atrevida.

source: For the last 25 years, Java has performed for organizations across the world but you've never seen anything like this. We'll cover all the classics like "Start Me Up" and "Living' on a VM" and some new jams like "Stairway to Native" and "Sweet JPA of Mine" and more.
es_es: Durante los últimos 25 años, Java ha actuado para organizaciones de todo el mundo, pero nunca habrás visto nada igual. Tocaremos todos los clásicos, como "Start Me Up" y "Living' on a VM", y algunas canciones nuevas, como "Stairway to Native" y "Sweet JPA of Mine", entre otras.

source: In this session the Quarkus Team will give you a unique, hands-on experience: An introduction to Quarkus, a follow-along hands-on demo or two and then a Q&A with some of the band, umm, developers involved.
es_es: En esta sesión, el equipo de Quarkus te ofrecerá una experiencia práctica única: Una introducción a Quarkus, una o dos demostraciones prácticas y, a continuación, una sesión de preguntas y respuestas con algunos de los desarrolladores implicados.

source: So join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, well, have more fun: 90 odd minutes of technical discussion, some live coding and a Q&A - it’s going to be a blast.
es_es: Acompáñanos a explorar cómo Quarkus ayuda a los desarrolladores Java de todo el mundo a ser más productivos, crear obras maestras modernas y, bueno, divertirse más: 90 minutos de debate técnico, codificación en directo y preguntas y respuestas: va a ser la bomba.

source: Abstract B - More Easy Listening
es_es: Resumen B - Escucha más fácil

source: Welcome to the Quarkus World Tour.
es_es: Bienvenido al Quarkus World Tour.

source: A unique experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world.
es_es: Una experiencia única con acceso a expertos de Quarkus diseñada para ayudarte a empezar con Java en un mundo Kubernetes.

source: Quarkus is the rising star for Kube Native Java as it re-imagines the Java stack to give you the performance characteristics and developer experience you need to create modern, high performing applications. Quarkus helps you use your existing skills and code in new ways and greatly reduces the technical burden when moving to a Kubernetes-centric environment.
es_es: Quarkus es la estrella emergente de Kube Native Java, ya que reimagina la pila Java para ofrecerle las características de rendimiento y la experiencia de desarrollador que necesita para crear aplicaciones modernas y de alto rendimiento. Quarkus le ayuda a utilizar sus habilidades y código existentes de nuevas maneras y reduce en gran medida la carga técnica al pasar a un entorno centrado en Kubernetes.

source: Join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, have a little bit more fun.
es_es: Únase a nosotros para descubrir cómo Quarkus ayuda a los desarrolladores Java de todo el mundo a ser más productivos, crear obras maestras modernas y divertirse un poco más.

source: It’s going to be a blast. 90 odd minutes of technical discussion, some live coding and a Q&A.
es_es: Va a ser una explosión. 90 minutos de debate técnico, codificación en directo y preguntas y respuestas.
