Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_versions/3.8/guides/kafka-streams.adoc.po
Languages: es_es

source: one more method to the `KafkaStreamsPipeline` class which obtains the current state for a given key:
es_es: un método más para la clase `KafkaStreamsPipeline` que obtiene el estado actual para una clave determinada:

source: A value for the given station id was found, so that value will be returned
es_es: Se encontró un valor para la estación indicada, por lo que se devolverá ese valor

source: No value was found, either because a non-existing station was queried or no measurement exists yet for the given station
es_es: No se ha encontrado ningún valor, ya sea porque se ha consultado una estación inexistente o porque todavía no existe ninguna medición para la estación indicada

source: Also create the method's return type in the file `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/GetWeatherStationDataResult.java`:
es_es: También cree el tipo de retorno del método en el archivo `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/GetWeatherStationDataResult.java`:

source: Also create `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/WeatherStationData.java`, which represents the actual aggregation result for a weather station:
es_es: También cree `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/WeatherStationData.java`, que representa el resultado de agregación actual de una estación meteorológica:

source: We now can add a simple REST endpoint (`aggregator/src/main/java/org/acme/kafka/streams/aggregator/rest/WeatherStationEndpoint.java`), which invokes `getWeatherStationData()` and returns the data to the client:
es_es: Ahora podemos agregar una ruta REST simple (`aggregator/src/main/java/org/acme/kafka/streams/aggregator/rest/WeatherStationEndpoint.java`), que invoque `getWeatherStationData()` y devuelva los datos al cliente:

source: Depending on whether a value was obtained, either return that value or a 404 response
es_es: Dependiendo de si se obtuvo un valor, devuelva ese valor o una respuesta 404

source: With this code in place, it's time to rebuild the application and the `aggregator` service in Docker Compose:
es_es: Con este código en su lugar, es hora de reconstruir la aplicación y el servicio `aggregator` en Docker Compose:

source: This will rebuild the `aggregator` container and restart its service. Once that's done, you can invoke the service's REST API to obtain the temperature data for one of the existing stations. To do so, you can use `httpie` in the tooling container launched before:
es_es: Esto reconstruirá el contenedor `aggregator` y reiniciará el servicio. Una vez completado, puede invocar la API REST del servicio para obtener los datos de temperatura de una de las estaciones existentes. Para ello, puede usar `httpie` en el contenedor de herramientas que se lanzó anteriormente:

source: Scaling Out
es_es: Escalado horizontal

source: A very interesting trait of Kafka Streams applications is that they can be scaled out, i.e. the load and state can be distributed amongst multiple application instances running the same pipeline. Each node will then contain a subset of the aggregation results, but Kafka Streams provides you with https://kafka.apache.org/22/documentation/streams/developer-guide/interactive-queries.html#querying-remote-state-stores-for-the-entire-app[an API] to obtain the information which node is hosting a given key. The application can then either fetch the data directly from the other instance, or simply point the client to the location of that other node.
es_es: Una característica muy interesante de las aplicaciones Kafka Streams es que pueden escalarse horizontalmente, es decir, la carga y el estado pueden distribuirse entre múltiples instancias de la aplicación que ejecutan el mismo flujo. Cada nodo contendrá entonces un subconjunto de los resultados de agregación, pero Kafka Streams le proporciona https://kafka.apache.org/22/documentation/streams/developer-guide/interactive-queries.html#querying-remote-state-stores-for-the-entire-app[una API] para obtener información sobre qué nodo aloja una clave determinada. La aplicación puede entonces recuperar los datos directamente de la otra instancia, o simplemente indicar al cliente la ubicación de ese otro nodo.

source: Launching multiple instances of the `aggregator` application will make look the overall architecture like so:
es_es: Lanzar múltiples instancias de la aplicación `aggregator` hará que la arquitectura general se vea así:

source: The `InteractiveQueries` class must be adjusted slightly for this distributed architecture:
es_es: La clase `InteractiveQueries` debe ajustarse ligeramente para adaptarse a esta arquitectura distribuida:

source: The streams metadata for the given weather station id is obtained
es_es: Se obtiene la metadata de los flujos para el id de estación meteorológica dado

source: The given key (weather station id) is maintained by the local application node, i.e. it can answer the query itself
es_es: La clave dada (ID de la estación meteorológica) es gestionada por el nodo de la aplicación local, es decir, puede responder la consulta por sí mismo

source: The given key is maintained by another application node; in this case the information about that node (host and port) will be returned
es_es: La clave dada es gestionada por otro nodo de aplicación; en este caso se devolverá la información sobre ese nodo (host y puerto)

source: The `getMetaData()` method is added to provide callers with a list of all the nodes in the application cluster.
es_es: El método `getMetaData()` es agregado para proporcionar a los clientes una lista de todos los nodos del clúster de la aplicación.

source: The `GetWeatherStationDataResult` type must be adjusted accordingly:
es_es: El tipo `GetWeatherStationDataResult` debe ajustarse en consecuencia:

source: Also, the return type for `getMetaData()` must be defined (`aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/PipelineMetadata.java`):
es_es: Además, se debe definir el tipo de retorno para `getMetaData()` (`aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/PipelineMetadata.java` ):

source: Lastly, the REST endpoint class must be updated:
es_es: Por último, se debe actualizar la clase del endpoint REST:

source: The data was found locally, so return it
es_es: Los datos se encontraron localmente, por lo que se devuelven

source: The data is maintained by another node, so reply with a redirect (HTTP status code 303) if the data for the given key is stored on one of the other nodes.
es_es: Los datos son gestionados por otro nodo, por lo que se debe responder con una redirección (código de estado HTTP 303) si los datos de la clave dada están almacenados en uno de los otros nodos.

source: No data was found for the given weather station id
es_es: No se encontraron datos para el ID de estación meteorológica proporcionado

source: Exposes information about all the hosts forming the application cluster
es_es: Expone información sobre todos los hosts que conforman el cluster de la aplicacion

source: Now stop the `aggregator` service again and rebuild it. Then let's spin up three instances of it:
es_es: Ahora detenga de nuevo el servicio `aggregator` y reconstrúyalo. Luego, inicie las tres instancias del mismo:

source: When invoking the REST API on any of the three instances, it might either be that the aggregation for the requested weather station id is stored locally on the node receiving the query, or it could be stored on one of the other two nodes.
es_es: Al invocar la API REST en cualquiera de las tres instancias, puede ocurrir que la agregación para el ID de la estación meteorológica solicitada este almacenada localmente en el nodo que recibe la consulta, o bien que esté almacenada en uno de los otros dos nodos.

source: As the load balancer of Docker Compose will distribute requests to the `aggregator` service in a round-robin fashion, we'll invoke the actual nodes directly. The application exposes information about all the host names via REST:
es_es: Como el balanceador de carga de Docker Compose distribuirá las solicitudes al servicio `aggregator` de manera round-robin, invocaremos los nodos reales directamente. La aplicación expone información sobre todos los nombres de host mediante REST:

source: Retrieve the data from one of the three hosts shown in the response (your actual host names will differ):
es_es: Recupere los datos de uno de los tres hosts mostrados en la respuesta (sus nombres de host reales serán diferentes):

source: If that node holds the data for key "1", you'll get a response like this:
es_es: Si ese nodo contiene los datos de la clave "1", obtendrás una respuesta como esta:

source: Otherwise, the service will send a redirect:
es_es: De lo contrario, el servicio enviará una redirección:

source: You can also have _httpie_ automatically follow the redirect by passing the `--follow option`:
es_es: También puede hacer que _httpie_ siga automáticamente la redirección pasando la opción `--follow`:

source: Running Natively
es_es: Ejecución Nativa

source: The Quarkus extension for Kafka Streams enables the execution of stream processing applications natively via GraalVM without further configuration.
es_es: La extensión de Quarkus para Kafka Streams permite la ejecución de aplicaciones de procesamiento de flujos de manera nativa mediante GraalVM sin necesidad de configuración adicional.

source: To run both the `producer` and `aggregator` applications in native mode, the Maven builds can be executed using `-Dnative`:
es_es: Para ejecutar las aplicaciones `producer` y `aggregator` en modo nativo, las compilaciones de Maven pueden ejecutarse usando `-Dnative`:

source: Now create an environment variable named `QUARKUS_MODE` and with value set to "native":
es_es: Ahora cree una variable de entorno llamada `QUARKUS_MODE` y con su valor establecido en "native":

source: This is used by the Docker Compose file to use the correct `Dockerfile` when building the `producer` and `aggregator` images. The Kafka Streams application can work with less than 50 MB RSS in native mode. To do so, add the `Xmx` option to the program invocation in `aggregator/src/main/docker/Dockerfile.native`:
es_es: Esto lo utiliza el archivo Docker Compose para emplear el `Dockerfile` correcto al construir las imágenes de `producer` y `aggregator`. La aplicación Kafka Streams puede funcionar con menos de 50 MB de RSS en modo nativo. Para ello, agregue la opción `Xmx` al invocar el programa en `aggregator/src/main/docker/Dockerfile.native`:

source: Now start Docker Compose as described above (don't forget to rebuild the container images).
es_es: Ahora inicie Docker Compose como se describió anteriormente (no olvide reconstruir las imágenes de los contenedores).

source: Kafka Streams Health Checks
es_es: Verificación del estado de Kafka Streams

source: If you are using the `quarkus-smallrye-health` extension, `quarkus-kafka-streams` will automatically add:
es_es: Si está utilizando la extensión `quarkus-smallrye-health`, `quarkus-kafka-streams` añadirá automáticamente:

source: a readiness health check to validate that all topics declared in the `quarkus.kafka-streams.topics` property are created,
es_es: una comprobación de disponibilidad para validar que se han creado todos los tópicos declarados en la propiedad `quarkus.kafka-streams.topics`,

source: a liveness health check based on the Kafka Streams state.
es_es: una comprobación de funcionamiento basada en el estado de Kafka Streams.

source: So when you access the `/q/health` endpoint of your application you will have information about the state of the Kafka Streams and the available and/or missing topics.
es_es: Así, cuando acceda a la ruta `/q/health` de su aplicación, obtendrá información sobre el estado de Kafka Streams y los tópicos disponibles y/o faltantes.

source: This is an example of when the status is `DOWN`:
es_es: Este es un ejemplo de cuando el estado es `DOWN`:

source: Liveness health check. Also available at `/q/health/live` endpoint.
es_es: Comprobación del funcionamiento. También disponible en la ruta `/q/health/live`.

source: Readiness health check. Also available at `/q/health/ready` endpoint.
es_es: Comprobación del estado de preparación. También disponible en la ruta `/q/health/ready`.

source: So as you can see, the status is `DOWN` as soon as one of the `quarkus.kafka-streams.topics` is missing or the Kafka Streams `state` is not `RUNNING`.
es_es: Así que, como puede ver, el estado es `DOWN` cuando falta uno de los `quarkus.kafka-streams.topics` o el `state` de Kafka Streams no es `RUNNING`.

source: If no topics are available, the `available_topics` key will not be present in the `data` field of the `Kafka Streams topics health check`. As well as if no topics are missing, the `missing_topics` key will not be present in the `data` field of the `Kafka Streams topics health check`.
es_es: Si no hay tópicos disponibles, la clave `available_topics` no estará presente en el campo `data` de la `comprobación del estado de los tópicos de Kafka Streams`. Asimismo, si no falta ningún tópico, la clave `missing_topics` no estará presente en el campo `data` de la `comprobación del estado de los tópicos de Kafka Streams`.

source: You can of course disable the health check of the `quarkus-kafka-streams` extension by setting the `quarkus.kafka-streams.health.enabled` property to `false` in your `application.properties`.
es_es: Por supuesto, puede desactivar la comprobación de estado de la extensión `quarkus-kafka-streams` estableciendo la propiedad `quarkus.kafka-streams.health.enabled` en `false` en su `application.properties`.

source: Obviously you can create your liveness and readiness probes based on the respective endpoints `/q/health/live` and `/q/health/ready`.
es_es: Obviamente, puede crear sus sondas de disponibilidad y de preparación basadas en las respectivas rutas `/q/health/live` y `/q/health/ready`.

source: Liveness health check
es_es: Comprobación del estado (Liveness)

source: Here is an example of the liveness check:
es_es: Aquí hay un ejemplo de la comprobación de estado (liveness):

source: The `state` is coming from the `KafkaStreams.State` enum.
es_es: El `state` viene del enum `KafkaStreams.State`.

source: Readiness health check
es_es: Comprobación del estado de preparación (readiness)

source: Here is an example of the readiness check:
es_es: Aquí hay un ejemplo de la comprobación de preparación (readiness):

source: Going Further
es_es: Ir más allá

source: This guide has shown how you can build stream processing applications using Quarkus and the Kafka Streams APIs, both in JVM and native modes. For running your KStreams application in production, you could also add health checks and metrics for the data pipeline. Refer to the Quarkus guides on xref:telemetry-micrometer.adoc[Micrometer], xref:smallrye-metrics.adoc[SmallRye Metrics], and xref:smallrye-health.adoc[SmallRye Health] to learn more.
es_es: Esta guía ha mostrado cómo puede construir aplicaciones de procesamiento de flujos utilizando Quarkus y las APIs de Kafka Streams, tanto en modo JVM como nativo. Para ejecutar su aplicación KStreams en producción, también podría añadir comprobaciones de salud y métricas para el flujo de datos. Consulte las guías de Quarkus sobre xref:telemetry-micrometer.adoc[Micrometer], xref:smallrye-metrics.adoc[SmallRye Metrics] y xref:smallrye-health.adoc[SmallRye Health] para obtener más información.

source: Configuration Reference
es_es: Referencia de configuración

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
es_es: <span class="icon"><i class="fa fa-lock" title="Fijado en tiempo de compilación"></i></span> Propiedad de configuración fijada en tiempo de compilación - Todas las demás propiedades de configuración son anulables en tiempo de ejecución <input type="search" id="config-search-0" placeholder="CONFIGURACIÓN DEL FILTRO" disabled>
