Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_versions/3.8/guides/kafka-streams.adoc.po
Languages: es_es

source: Using Apache Kafka Streams
es_es: Usando Apache Kafka Streams

source: This guide demonstrates how your Quarkus application can utilize the Apache Kafka Streams API to implement stream processing applications based on Apache Kafka.
es_es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar la API de Apache Kafka Streams para implementar aplicaciones de procesamiento de flujos basadas en Apache Kafka.

source: Prerequisites
es_es: Requisitos previos

source: It is recommended, that you have read the link:{quickstarts-tree-url}/kafka-quickstart[Kafka quickstart] before.
es_es: Se recomienda haber leído antes el enlace {quickstarts-tree-url}/kafka-quickstart[Kafka quickstart].

source: A recommended development set-up is to have some producer which creates test messages on the processed topic(s) in fixed intervals, e.g. every second and observe the streaming application's output topic(s) using a tool such as `kafkacat`. Using the dev mode, you'll instantly see messages on the output topic(s) as produced by the latest version of your streaming application when saving.
es_es: Una configuración de desarrollo recomendada es contar con un productor que genere mensajes de prueba en los tópicos procesados a intervalos fijos, por ejemplo cada segundo, y observar los mensajes en los tópicos de salida de la aplicación de streaming utilizando una herramienta como `kafkacat`. Con el modo de desarrollo, verá al instante los mensajes en los tópicos de salida tal como los produce la última versión de su aplicación de streaming al guardar los cambios.

source: For the best development experience, we recommend applying the following configuration settings to your Kafka broker:
es_es: Para obtener la mejor experiencia de desarrollo, recomendamos aplicar las siguientes configuraciones a su corredor de Kafka:

source: Also specify the following settings in your Quarkus `application.properties`:
es_es: Especifique también las siguientes configuraciones en su archivo `application.properties` de Quarkus:

source: Together, these settings will ensure that the application can very quickly reconnect to the broker after being restarted in dev mode.
es_es: En conjunto, estas configuraciones garantizarán que la aplicación pueda reconectarse muy rápidamente al corredor después de reiniciarse en el Modo de Desarrollo.

source: Architecture
es_es: Arquitectura

source: In this guide, we are going to generate (random) temperature values in one component (named `generator`). These values are associated to given weather stations and are written in a Kafka topic (`temperature-values`). Another topic (`weather-stations`) contains just the main data about the weather stations themselves (id and name).
es_es: En esta guía, vamos a generar valores de temperatura (aleatorios) en un componente llamado `generator`. Estos valores están asociados a determinadas estaciones meteorológicas y se escriben en un tópico de Kafka ( `temperature-values` ). Otro tópico (`weather-stations`) contiene únicamente los datos principales de las estaciones meteorológicas (id y nombre).

source: A second component (`aggregator`) reads from the two Kafka topics and processes them in a streaming pipeline:
es_es: Un segundo componente (`aggregator`) lee de los dos tópicos de Kafka y los procesa en un flujo de streaming:

source: the two topics are joined on weather station id
es_es: los dos tópicos se combinan según el ID de la estación meteorológica

source: per weather station the min, max and average temperature is determined
es_es: para cada estación meteorológica se determinan la temperatura mínima, máxima y promedio

source: this aggregated data is written out to a third topic (`temperatures-aggregated`)
es_es: estos datos agregados se escriben en un tercer tópico ( `temperatures-aggregated`)

source: The data can be examined by inspecting the output topic. By exposing a Kafka Streams https://kafka.apache.org/22/documentation/streams/developer-guide/interactive-queries.html[interactive query], the latest result for each weather station can alternatively be obtained via a simple REST query.
es_es: Los datos pueden examinarse inspeccionando el tópico de salida. Mediante la exposición de una link:https://kafka.apache.org/22/documentation/streams/developer-guide/interactive-queries.html[consulta interactiva] de Kafka Streams, el último resultado de cada estación meteorológica puede obtenerse alternativamente a través de una sencilla consulta REST.

source: The overall architecture looks like so:
es_es: La arquitectura general se ve así:

source: Solution
es_es: Solución

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example.
es_es: Recomendamos que siga las instrucciones de las siguientes secciones y cree la aplicación paso a paso. Sin embargo, también puede ir directamente al ejemplo completo.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
es_es: Clone el repositorio Git: `git clone {quickstarts-clone-url}` o descargue un {quickstarts-archive-url}[archivo].

source: The solution is located in the `kafka-streams-quickstart` link:{quickstarts-tree-url}/kafka-streams-quickstart[directory].
es_es: La solución se encuentra en el directorio link:{quickstarts-tree-url}[`kafka-streams-quickstart`].

source: Creating the Producer Maven Project
es_es: Creación del proyecto Maven del productor

source: First, we need a new project with the temperature value producer. Create a new project with the following command:
es_es: Primero, necesitamos un nuevo proyecto con el productor de valores de temperatura. Cree un nuevo proyecto con el siguiente comando:

source: This command generates a Maven project, importing the Reactive Messaging and Kafka connector extensions.
es_es: Este comando genera un proyecto Maven, importando las extensiones de Mensajería Reactiva y el conector de Kafka.

source: This will add the following to your build file:
es_es: Esto añadirá lo siguiente a su archivo de construcción:

source: The Temperature Value Producer
es_es: El productor de valores de temperatura

source: Create the `producer/src/main/java/org/acme/kafka/streams/producer/generator/ValuesGenerator.java` file, with the following content:
es_es: Cree el archivo `producer/src/main/java/org/acme/kafka/streams/producer/generator/ValuesGenerator.java`, con el siguiente contenido:

source: Instruct Reactive Messaging to dispatch the items from the returned `Multi` to `temperature-values`.
es_es: Indique a Mensajería Reactiva que envíe los elementos de la `Multi` devuelta a `temperature-values`.

source: The method returns a Mutiny _stream_ (`Multi`) emitting a random temperature value every 0.5 seconds.
es_es: El método devuelve un _flujo_ Mutiny ( `Multi`) que emite un valor de temperatura aleatorio cada 0,5 segundos.

source: Instruct Reactive Messaging to dispatch the items from the returned `Multi` (static list of weather stations) to `weather-stations`.
es_es: Indique a Mensajería Reactiva que envíe los elementos de la `Multi` devuelta (lista estática de estaciones meteorológicas) a `weather-stations`.

source: The two methods each return a _reactive stream_ whose items are sent to the streams named `temperature-values` and `weather-stations`, respectively.
es_es: Ambos métodos devuelven un _flujo reactivo_ cuyos elementos se envían a los flujos denominados `temperature-values` y `weather-stations`, respectivamente.

source: Topic Configuration
es_es: Configuración de los tópicos

source: The two channels are mapped to Kafka topics using the Quarkus configuration file `application.properties`. For that, add the following to the file `producer/src/main/resources/application.properties`:
es_es: Los dos canales se asignan a tópicos de Kafka utilizando el archivo de configuración de Quarkus `application.properties`. Para ello, agregue lo siguiente al archivo `producer/src/main/resources/application.properties`:

source: This configures the Kafka bootstrap server, the two topics and the corresponding (de-)serializers. More details about the different configuration options are available on the https://kafka.apache.org/documentation/#producerconfigs[Producer configuration] and https://kafka.apache.org/documentation/#consumerconfigs[Consumer configuration] section from the Kafka documentation.
es_es: Esta configuración define el servidor bootstrap de Kafka, los dos tópicos y los (de)serializadores correspondientes. Más detalles sobre las diferentes opciones de configuración están disponibles en la documentación de Kafka, en las secciones https://kafka.apache.org/documentation/#producerconfigs[Configuración del productor] y https://kafka.apache.org/documentation/#consumerconfigs[Configuración del consumidor].

source: Creating the Aggregator Maven Project
es_es: Creación del proyecto Maven del agregador

source: With the producer application in place, it's time to implement the actual aggregator application, which will run the Kafka Streams pipeline. Create another project like so:
es_es: Con la aplicación productora en su lugar, es momento de implementar la aplicación agregadora real, que ejecutará el flujo de Kafka Streams. Cree otro proyecto de la siguiente manera:

source: If you already have your Quarkus project configured, you can add the `kafka-streams` extension to your project by running the following command in your project base directory:
es_es: Si ya tiene su proyecto Quarkus configurado, puede añadir la extensión `kafka-streams` a su proyecto ejecutando el siguiente comando en el directorio base del proyecto:

source: This will add the following to your `pom.xml`:
es_es: Esto añadirá lo siguiente a su `pom.xml`:

source: The Pipeline Implementation
es_es: Implementación del flujo

source: Let's begin the implementation of the stream processing application by creating a few value objects for representing temperature measurements, weather stations and for keeping track of aggregated values.
es_es: Comencemos la implementación de la aplicación de procesamiento de flujos creando algunos objetos de valor para representar las mediciones de temperatura, las estaciones meteorológicas y para llevar el registro de los valores agregados.

source: First, create the file `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/WeatherStation.java`, representing a weather station, with the following content:
es_es: Primero, cree el archivo `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/WeatherStation.java`,' que representa una estación meteorológica, con el siguiente contenido:

source: The `@RegisterForReflection` annotation instructs Quarkus to keep the class and its members during the native compilation. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
es_es: La anotación `@RegisterForReflection` indica a Quarkus que mantenga la clase y sus miembros durante la compilación nativa. Puede encontrar más detalles sobre la anotación `@RegisterForReflection` en la página xref:writing-native-applications-tips.html#registerForReflection[consejos para aplicaciones nativas].

source: Then the file `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/TemperatureMeasurement.java`, representing temperature measurements for a given station:
es_es: Luego, cree el archivo `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/TemperatureMeasurement.java`, que representa las mediciones de temperatura de una estación determinada:

source: And finally `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/Aggregation.java`, which will be used to keep track of the aggregated values while the events are processed in the streaming pipeline:
es_es: Y finalmente, `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/Aggregation.java`, que se utilizará para llevar el seguimiento de los valores agregados mientras los eventos se procesan en el flujo de transmisión:

source: Next, let's create the actual streaming query implementation itself in the `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/TopologyProducer.java` file. All we need to do for that is to declare a CDI producer method which returns the Kafka Streams `Topology`; the Quarkus extension will take care of configuring, starting and stopping the actual Kafka Streams engine.
es_es: A continuación, vamos a crear la implementación de la consulta de flujo en sí en el archivo `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/TopologyProducer.java`. Todo lo que necesitamos hacer para ello es declarar un método productor CDI que devuelva la `Topology` de Kafka Streams; la extensión de Quarkus se encargará de configurar, iniciar y detener el motor real de Kafka Streams.

source: The `weather-stations` table is read into a `GlobalKTable`, representing the current state of each weather station
es_es: La tabla `weather-stations` se lee en un `GlobalKTable`, representando el estado actual de cada estación meteorológica

source: The `temperature-values` topic is read into a `KStream`; whenever a new message arrives to this topic, the pipeline will be processed for this measurement
es_es: El tópico `temperature-values` se lee en un `KStream`; cada vez que llega un nuevo mensaje a este tópico, el flujo se procesará para esta medición

source: The message from the `temperature-values` topic is joined with the corresponding weather station, using the topic's key (weather station id); the join result contains the data from the measurement and associated weather station message
es_es: El mensaje del tópico `temperature-values` se une con la estación meteorológica correspondiente, utilizando la clave del tópico (id de la estación meteorológica); el resultado de la unión contiene los datos de la medición y el mensaje asociado de la estación meteorológica

source: The values are grouped by message key (the weather station id)
es_es: Los valores se agrupan por la clave del mensaje (el id de la estación meteorológica)

source: Within each group, all the measurements of that station are aggregated, by keeping track of minimum and maximum values and calculating the average value of all measurements of that station (see the `Aggregation` type)
es_es: Dentro de cada grupo, todas las mediciones de esa estación se agregan, manteniendo un registro de los valores mínimos y máximos y calculando el valor promedio de todas las mediciones de esa estación (consulte el tipo `Aggregation`)

source: The results of the pipeline are written out to the `temperatures-aggregated` topic
es_es: Los resultados del flujo se escriben en el tópico `temperatures-aggregated`

source: The Kafka Streams extension is configured via the Quarkus configuration file `application.properties`. Create the file `aggregator/src/main/resources/application.properties` with the following contents:
es_es: La extensión de Kafka Streams se configura mediante el archivo de configuración de Quarkus `application.properties`. Cree el archivo `aggregator/src/main/resources/application.properties` con el siguiente contenido:

source: The options with the `quarkus.kafka-streams` prefix can be changed dynamically at application startup, e.g. via environment variables or system properties. `bootstrap-servers` and `application-server` are mapped to the Kafka Streams properties `bootstrap.servers` and `application.server`, respectively. `topics` is specific to Quarkus: the application will wait for all the given topics to exist before launching the Kafka Streams engine. This is to done to gracefully await the creation of topics that don't yet exist at application startup time.
es_es: Las opciones con el prefijo `quarkus.kafka-streams` se pueden cambiar dinámicamente al iniciar la aplicación, por ejemplo, mediante variables de entorno o propiedades del sistema. `bootstrap-servers` y `application-server` se asignan a las propiedades de Kafka Streams `bootstrap.servers` y `application.server`, respectivamente. `topics` es específico de Quarkus: la aplicación esperará a que existan todos los tópicos indicados antes de iniciar el motor de Kafka Streams. Esto se hace para esperar de manera ordenada la creación de tópicos que aún no existen al iniciar la aplicación.

source: Alternatively, you can use `kafka.bootstrap.servers` instead of `quarkus.kafka-streams.bootstrap-servers` as you did in the _generator_ project above.
es_es: Como alternativa, puede usar `kafka.bootstrap.servers` en lugar de `quarkus.kafka-streams.bootstrap-servers`, tal como se hizo en el proyecto _generator_ mencionado anteriormente.

source: Once you are ready to promote your application into production, consider changing the above configuration values. While `cache.max.bytes.buffering=10240` will move your records faster through the topology, the default value of `10485760` is more throughput-friendly. Also condider increasing `metadata.max.age.ms` from `500`, which will update cluster metadata quickly, but will generate a lot of redundant requests, to a value closer to the default of `300000`. A `commit.interval.ms` of `1000` is good for exactly-once processing, but might generate excessive load for the default at-least-once processing with the default value of `30000`.
es_es: Una vez que esté listo para promover su aplicación a producción, considere cambiar los valores de configuración anteriores. Mientras que `cache.max.bytes.buffering=10240` moverá sus registros más rápidamente a través de la topología, el valor predeterminado de `10485760` es más adecuado para el rendimiento de alto flujo. También considere aumentar `metadata.max.age.ms` desde `500`, lo cual actualizará rápidamente los metadatos del clúster, pero generará muchas solicitudes redundantes, a un valor más cercano al predeterminado de `300000`. Un `commit.interval.ms` de `1000` es bueno para el procesamiento *exactly-once*, pero podría generar una carga excesiva para el procesamiento *at-least-once* con el valor predeterminado de `30000`.

source: All the properties within the `kafka-streams` namespace are passed through as-is to the Kafka Streams engine. Changing their values requires a rebuild of the application.
es_es: Todas las propiedades dentro del espacio de nombres `kafka-streams` se pasan tal cual al motor de Kafka Streams. Cambiar sus valores requiere una reconstrucción de la aplicación.

source: Building and Running the Applications
es_es: Construcción y ejecución de las aplicaciones

source: We now can build the `producer` and `aggregator` applications:
es_es: Ahora podemos compilar las aplicaciones `producer` y `aggregator`:

source: Instead of running them directly on the host machine using the Quarkus dev mode, we're going to package them into container images and launch them via Docker Compose. This is done in order to demonstrate scaling the `aggregator` aggregation to multiple nodes later on.
es_es: En lugar de ejecutarlas directamente en la máquina host utilizando el modo dev de Quarkus, vamos a empaquetarlas en imágenes de contenedor y lanzarlas mediante Docker Compose. Esto se hace con el fin de demostrar cómo escalar la agregación del `aggregator` a múltiples nodos más adelante.

source: The `Dockerfile` created by Quarkus by default needs one adjustment for the `aggregator` application in order to run the Kafka Streams pipeline. To do so, edit the file `aggregator/src/main/docker/Dockerfile.jvm` and replace the line `FROM fabric8/java-alpine-openjdk8-jre` with `FROM fabric8/java-centos-openjdk8-jdk`.
es_es: El `Dockerfile` creado por Quarkus por defecto necesita un ajuste para la aplicación `aggregator` con el fin de ejecutar el flujo de Kafka Streams. Para ello, edite el archivo `aggregator/src/main/docker/Dockerfile.jvm` y reemplace la línea `FROM fabric8/java-alpine-openjdk8-jre` por `FROM fabric8/java-centos-openjdk8-jdk`.

source: Next create a Docker Compose file (`docker-compose.yaml`) for spinning up the two applications as well as Apache Kafka and ZooKeeper like so:
es_es: A continuación, cree un archivo Docker Compose ( `docker-compose.yaml`) para levantar las dos aplicaciones, así como Apache Kafka y ZooKeeper, de la siguiente manera:

source: To launch all the containers, building the `producer` and `aggregator` container images, run `docker-compose up --build`.
es_es: Para iniciar todos los contenedores, construyendo las imágenes de contenedor `producer` y `aggregator`, ejecute `docker-compose up --build`.

source: Instead of `QUARKUS_KAFKA_STREAMS_BOOTSTRAP_SERVERS`, you can use `KAFKA_BOOTSTRAP_SERVERS`.
es_es: En lugar de `QUARKUS_KAFKA_STREAMS_BOOTSTRAP_SERVERS`, puede usar `KAFKA_BOOTSTRAP_SERVERS`.

source: You should see log statements from the `producer` application about messages being sent to the "temperature-values" topic.
es_es: Debería ver declaraciones de registro de la aplicación `producer` sobre los mensajes enviados al tópico "temperature-values".

source: Now run an instance of the _debezium/tooling_ image, attaching to the same network all the other containers run in. This image provides several useful tools such as _kafkacat_ and _httpie_:
es_es: Ahora ejecute una instancia de la imagen _debezium/tooling_, conectándola a la misma red en la que se ejecutan todos los demás contenedores. Esta imagen proporciona varias herramientas útiles, como _kafkacat_ y _httpie_:

source: Within the tooling container, run _kafkacat_ to examine the results of the streaming pipeline:
es_es: Dentro del contenedor de herramientas, ejecute _kafkacat_ para examinar los resultados de la transmisión del flujo:

source: You should see new values arrive as the producer continues to emit temperature measurements, each value on the outbound topic showing the minimum, maximum and average temperature values of the represented weather station.
es_es: Debería ver llegar nuevos valores a medida que el productor continúa emitiendo mediciones de temperatura, cada valor en el tópico de salida mostrando los valores mínimo, máximo y promedio de temperatura de la estación meteorológica representada.

source: Interactive Queries
es_es: Consultas interactivas

source: Subscribing to the `temperatures-aggregated` topic is a great way to react to any new temperature values. It's a bit wasteful though if you're just interested in the latest aggregated value for a given weather station. This is where Kafka Streams interactive queries shine: they let you directly query the underlying state store of the pipeline for the value associated to a given key. By exposing a simple REST endpoint which queries the state store, the latest aggregation result can be retrieved without having to subscribe to any Kafka topic.
es_es: Suscribirse al tópico `temperatures-aggregated` es una excelente manera de reaccionar ante cualquier nuevo valor de temperatura. Sin embargo, es un poco ineficiente si solo le interesa el último valor agregado de una estación meteorológica específica. Aquí es donde las consultas interactivas de Kafka Streams destacan: permiten consultar directamente el almacén de estado subyacente del flujo para obtener el valor asociado a una clave determinada. Al exponer un endpoint REST simple que consulte el almacén de estado, se puede recuperar el resultado de la última agregación sin necesidad de suscribirse a ningún tópico de Kafka.

source: Let's begin by creating a new class `InteractiveQueries` in the file `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/InteractiveQueries.java`:
es_es: Comencemos creando una nueva clase `InteractiveQueries` en el archivo `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/InteractiveQueries.java`:
