Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_versions/3.8/guides/kubernetes-dev-services.adoc.po
Languages: es_es

source: Dev Services for Kubernetes
es_es: Servicios de desarrollo para Kubernetes

source: Enabling / Disabling Dev Services for Kubernetes
es_es: Activación y desactivación de los servicios de desarrollo para Kubernetes

source: Dev Services for Kubernetes is automatically enabled unless:
es_es: Dev Services para Kubernetes se activa automáticamente a menos que:

source: `quarkus.kubernetes-client.devservices.enabled` is set to `false`
es_es: `quarkus.kubernetes-client.devservices.enabled` se establece en `false`

source: the `api-server-url` is configured
es_es: el `master-url` está configurado

source: a valid Kube config file is found and `quarkus.kubernetes-client.devservices.override-kubeconfig` is not set to `true`
es_es: se encuentra un archivo de configuración de Kube válido y `quarkus.kubernetes-client.devservices.override-kubeconfig` no está configurado como `true`

source: you include the `quarkus-test-kubernetes-client` dependency
es_es: incluye la dependencia `quarkus-test-kubernetes-client`

source: Shared cluster
es_es: Clúster compartido

source: Dev Services for Kubernetes starts the container with the `quarkus-dev-service-kubernetes` label which is used to identify the container.
es_es: Dev Services for Kubernetes inicia el contenedor con la etiqueta `quarkus-dev-service-kubernetes` que se utiliza para identificar el contenedor.

source: Configuring the cluster
es_es: Configuración del clúster

source: `api-only` only starts a Kubernetes API Server. If you need a fully-featured Kubernetes cluster that can spin up Pods, you can use `k3s` or `kind`. Note that they both requires to run in Docker privileged mode.
es_es: `api-only` sólo inicia un servidor API Kubernetes. Si necesita un clúster Kubernetes con todas las funciones que puede girar Pods, puede utilizar `k3s` o `kind`. Tenga en cuenta que ambos requieren para ejecutar en modo privilegiado Docker.

source: If `api-version` is not set, the latest version for the given flavor will be used. Otherwise, the version must match a https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[version supported by the given flavor].
es_es: Si no se define `api-version`, se utilizará la versión más reciente para el tipo dado. De lo contrario, la versión debe coincidir con una https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[versión soportada por el sabor] dado.
