Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_versions/3.8/guides/quarkus-runtime-*-image.adoc.po
Languages: es_es

source: Quarkus Base Runtime Image
es_es: Imagen de tiempo de ejecución de Quarkus Base

source: small (based on `ubi8-micro`)
es_es: pequeño (basado en `ubi8-micro`)

source: designed for containers
es_es: diseñado para contenedores

source: contains the right set of dependencies (glibc, libstdc++, zlib)
es_es: contiene el conjunto correcto de dependencias (glibc, libstdc++, zlib)

source: support upx-compressed executables (more details on the xref:upx.adoc[enabling compression documentation])
es_es: soportar los ejecutables comprimidos por upx (más detalles en la xref:upx.adoc[documentación sobre la habilitación de la compresión])

source: Using the base image
es_es: Uso de la imagen base

source: In your `Dockerfile`, just use:
es_es: En su `Dockerfile`, sólo tiene que utilizar:

source: Extending the image
es_es: Ampliación de la imagen

source: If you need to have access to the full AWT support, you need more than just `libfreetype.so`, but also the font and font configurations:
es_es: Si necesita tener acceso al soporte completo de AWT, necesita algo más que `libfreetype.so`, sino también la fuente y las configuraciones de fuente:

source: Alternative - Using ubi-minimal
es_es: Alternativa - Uso de ubi-minimal

source: To use this base image, use the following `Dockerfile`:
es_es: Para utilizar esta imagen de base, utilice la siguiente dirección `Dockerfile`:
