Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_guides/amqp-dev-services.adoc.po
Languages: es_es

source: Dev Services for AMQP
es_es: Servicios de desarrollo para AMQP

source: Dev Services for AMQP automatically starts an AMQP 1.0 broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
es_es: Los servicios de desarrollo para AMQP inician automáticamente un broker AMQP 1.0 en modo desarrollo y al ejecutar pruebas. Por lo tanto, no tiene que iniciar un broker manualmente. La aplicación se configura automáticamente.

source: Enabling / Disabling Dev Services for AMQP
es_es: Activación/desactivación de los servicios de desarrollo para AMQP

source: Dev Services for AMQP is automatically enabled unless:
es_es: Los servicios de desarrollo para AMQP se activan automáticamente a menos que:

source: `quarkus.amqp.devservices.enabled` is set to `false`
es_es: `quarkus.amqp.devservices.enabled` se ajusta a `false`

source: the `amqp-host` or `amqp-port` is configured
es_es: el `amqp-host` o `amqp-port` está configurado

source: all the Reactive Messaging AMQP channels have the `host` or `port` attributes set
es_es: todos los canales AMQP de Mensajería Reactiva tienen establecidos los atributos `host` o `port`

source: Dev Services for AMQP relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker access using the `amqp-host`, `amqp-port`, `amqp-user` and `amqp-password` properties.
es_es: Los servicios de desarrollo para AMQP se basan en Docker para iniciar el broker. Si su entorno no soporta Docker, tendrá que iniciar el broker manualmente, o conectarse a un broker ya en ejecución. Puede configurar el acceso al broker utilizando las propiedades `amqp-host` , `amqp-port` , `amqp-user` y `amqp-password`.

source: Shared broker
es_es: Broker compartido

source: Most of the time you need to share the broker between applications. Dev Services for AMQP implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
es_es: La mayoría de las veces necesitará compartir el broker entre aplicaciones. Los servicios de desarrollo para AMQP implementa un mecanismo de _descubrimiento de servicios_ para que sus múltiples aplicaciones Quarkus ejecutadas en modo _dev_ compartan un único broker.

source: Dev Services for AMQP starts the container with the `quarkus-dev-service-amqp` label which is used to identify the container.
es_es: Los servicios de desarrollo para AMQP inicia el contenedor con la etiqueta `quarkus-dev-service-amqp` que se utiliza para identificar el contenedor.

source: If you need multiple (shared) brokers, you can configure the `quarkus.amqp.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `amqp`.
es_es: Si necesita varios corredores (compartidos), puede configurar el atributo `quarkus.amqp.devservices.service-name` e indicar el nombre del corredor. Éste buscará un contenedor con el mismo valor o iniciará uno nuevo si no encuentra ninguno. El nombre de servicio por defecto es `amqp`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.amqp.devservices.shared=false`.
es_es: El uso compartido está activado por defecto en el modo desarrollo, pero desactivado en el modo de prueba. Puede desactivar el uso compartido con `quarkus.amqp.devservices.shared=false`.

source: Setting the port
es_es: Configuración del puerto

source: By default, Dev Services for AMQP picks a random port and configures the application. You can set the port by configuring the `quarkus.amqp.devservices.port` property.
es_es: Por defecto, Dev Services para AMQP elige un puerto aleatorio y configura la aplicación. Puede establecer el puerto configurando la propiedad `quarkus.amqp.devservices.port`.

source: Configuring the image
es_es: Configuración de la imagen

source: Dev Services for AMQP uses https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker] images. You can configure the image and version using the `quarkus.amqp.devservices.image-name` property:
es_es: Los servicios de desarrollo para AMQP utiliza las imágenes link:https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker]. Puede configurar la imagen y la versión utilizando la propiedad `quarkus.amqp.devservices.image-name`:

source: The configured image must be _compatible_ with the `activemq-artemis-broker` one. The container is launched with the `AMQ_USER`, `AMQ_PASSWORD` and `AMQ_EXTRA_ARGS` environment variables. The ports 5672 and 8161 (web console) are exposed.
es_es: La imagen configurada debe ser _compatible_ con la de `activemq-artemis-broker`. El contenedor se lanza con las variables de entorno `AMQ_USER` , `AMQ_PASSWORD` y `AMQ_EXTRA_ARGS`. Los puertos 5672 y 8161 (consola web) están expuestos.
