Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_guides/conditional-extension-dependencies.adoc.po
Languages: es_es

source: Conditional Extension Dependencies
es_es: Dependencias de extensión condicional

source: Quarkus extension dependencies are usually configured in the same way as any other project dependencies in the project's build file, e.g. the Maven `pom.xml` or the Gradle build scripts. However, there are dependency types that aren't yet supported out-of-the-box by Maven and Gradle. What we refer here to as "conditional dependencies" is one example.
es_es: Las dependencias de las extensiones de Quarkus normalmente se configuran de la misma manera que cualquier otra dependencia del proyecto en el archivo de construcción del proyecto, por ejemplo, en Maven `pom.xml` o en los scripts de construcción de Gradle. Sin embargo, hay tipos de dependencias que todavía no están soportadas por Maven y Gradle. Lo que aquí llamamos "dependencias condicionales" es un ejemplo.

source: Conditional Dependencies
es_es: Dependencias condicionales

source: The idea behind the notion of the conditional dependency is that such a dependency must be activated only if a certain condition is satisfied. If the condition is not satisfied then the dependency **must not** be activated. In that regard, conditional dependencies can be categorized as optional, i.e. they may or may not appear in the resulting set of project dependencies.
es_es: La idea que subyace a la noción de dependencia condicional es que dicha dependencia debe activarse sólo si se cumple una determinada condición. Si la condición no se cumple, la dependencia **no debe** activarse. En este sentido, las relaciones condicionales pueden clasificarse como opcionales, es decir, pueden aparecer o no en el conjunto resultante de relaciones del proyecto.

source: In which cases could conditional dependencies be useful? A typical example would be a component that should be activated **only** in case all of its required dependencies are available. If one or more of the component's required dependencies aren't available, instead of failing, the component should simply not be activated.
es_es: ¿En qué casos podrían ser útiles las dependencias condicionales? Un ejemplo típico sería un componente que debe activarse **sólo** en caso de que todas sus dependencias requeridas estén disponibles. Si una o más de las dependencias necesarias del componente no están disponibles, en lugar de fallar, el componente simplemente no debería activarse.

source: Quarkus Conditional Extension Dependencies
es_es: Dependencias de la extensión condicional de Quarkus

source: Quarkus supports conditional extension dependencies. I.e. one Quarkus extension may declare one or more conditional dependencies on other Quarkus extensions. Conditional dependencies on and from non-extension artifacts aren't supported.
es_es: Quarkus admite las dependencias condicionales de las extensiones. Es decir, una extensión de Quarkus puede declarar una o más dependencias condicionales de otras extensiones de Quarkus. No se admiten dependencias condicionales en y desde artefactos que no sean extensiones.

source: Let's take the following scenario as an example: `quarkus-extension-a` has an optional dependency on `quarkus-extension-b` which should be included in a Quarkus application only if `quarkus-extension-c` is found among its dependencies (direct or transitive). In other words, the presence of `quarkus-extension-c` is the condition which, if satisfied, enables `quarkus-extension-b` during the build of a Quarkus application.
es_es: Tomemos el siguiente escenario como ejemplo: `quarkus-extension-a` tiene una dependencia opcional de `quarkus-extension-b` que debe incluirse en una aplicación Quarkus sólo si `quarkus-extension-c` se encuentra entre sus dependencias (directas o transitivas). En otras palabras, la presencia de `quarkus-extension-c` es la condición que, si se cumple, habilita a `quarkus-extension-b` durante la construcción de una aplicación Quarkus.

source: The condition which triggers activation of an extension is configured in the extension's descriptor, which is included into the runtime artifact of the extension as `META-INF/quarkus-extension.properties`. Given that extension descriptor is generated by the Quarkus plugin at extension build time, extension developers can add the following configuration to express the condition which would have to be satisfied for the extension to be activated:
es_es: La condición que desencadena la activación de una extensión se configura en el descriptor de la extensión, que se incluye en el artefacto de tiempo de ejecución de la extensión como `META-INF/quarkus-extension.properties`. Dado que el descriptor de la extensión es generado por el plugin de Quarkus en el momento de la construcción de la extensión, los desarrolladores de la extensión pueden añadir la siguiente configuración para expresar la condición que tendría que ser satisfecha para que la extensión sea activada:

source: runtime Quarkus extension artifact ID, in our example `quarkus-extension-b`;
es_es: ID del artefacto de extensión de Quarkus en tiempo de ejecución, en nuestro ejemplo `quarkus-extension-b`;

source: the goal that generates the extension descriptor which every Quarkus runtime extension project should be configured with;
es_es: el objetivo que genera el descriptor de extensión con el que debe configurarse cada proyecto de extensión en tiempo de ejecución de Quarkus;

source: configuration of the condition which will have to be satisfied for this extension to be included into a Quarkus application expressed as a list of artifacts that must be present among the application dependencies;
es_es: configuración de la condición que tendrá que ser satisfecha para que esta extensión sea incluida en una aplicación Quarkus expresada como una lista de artefactos que deben estar presentes entre las dependencias de la aplicación;

source: an artifact key (in the format of `groupId:artifactId[:<classifier>:<extension>]` but typically simply `<groupId>:<artifactId>`) of the artifact that must be present among the application dependencies for the condition to be satisfied.
es_es: una clave de artefacto (con el formato de `groupId:artifactId[:<classifier>:<extension>]`, pero normalmente es simplemente `<groupId>:<artifactId>`) del artefacto que debe estar presente entre las dependencias de la aplicación para que se cumpla la condición.

source: In the example above the `artifact` used in the condition configuration happens to be a runtime Quarkus extension artifact but it could as well be any other artifact. There could also be more than one `artifact` element in the body of `dependencyCondition`.
es_es: En el ejemplo anterior, el `artifact` utilizado en la configuración de la condición resulta ser un artefacto de extensión de Quarkus en tiempo de ejecución, pero también podría ser cualquier otro artefacto. También podría haber más de un elemento `artifact` en el cuerpo de `dependencyCondition`.

source: Now, having a dependency activating condition in the descriptor of `quarkus-extension-b`, other extensions may declare a conditional dependency on it.
es_es: Ahora, al tener una condición de activación de la dependencia en el descriptor de `quarkus-extension-b`, otras extensiones pueden declarar una dependencia condicional sobre ella.

source: A conditional dependency is configured in the runtime artifact of a Quarkus extension. In our example, it's the `quarkus-extension-a` that has a conditional dependency on `quarkus-extension-b`, which can be expressed in two ways.
es_es: Una dependencia condicional se configura en el artefacto de tiempo de ejecución de una extensión de Quarkus. En nuestro ejemplo, es el `quarkus-extension-a` el que tiene una dependencia condicional de `quarkus-extension-b`, que puede expresarse de dos maneras.

source: Declaring a dependency as `optional`
es_es: Declarar una dependencia como `optional`

source: If an extension was configured with a dependency condition in its descriptor, other extensions may configure a conditional dependency on it by simply adding `<optional>true</optional>` to the dependency configuration. In our example it would look like this:
es_es: Si una extensión fue configurada con una condición de dependencia en su descriptor, otras extensiones pueden configurar una dependencia condicional sobre ella simplemente añadiendo `<optional>true</optional>` a la configuración de la dependencia. En nuestro ejemplo se vería así:

source: the runtime extension artifact `quarkus-extension-a`
es_es: el artefacto de extensión en tiempo de ejecución `quarkus-extension-a`

source: declares an optional Maven dependency on the runtime extension artifact `quarkus-extension-b`
es_es: declara una dependencia opcional de Maven del artefacto de extensión en tiempo de ejecución `quarkus-extension-b`

source: In general, for every runtime extension artifact dependency on another runtime extension artifact there must be a corresponding deployment extension artifact dependency on the other deployment extension artifact. And if the runtime dependency is declared as optional then the corresponding deployment dependency **must** also be configured as optional.
es_es: En general, para cada dependencia de un artefacto de extensión en tiempo de ejecución de otro artefacto de extensión en tiempo de ejecución debe haber una dependencia correspondiente de un artefacto de extensión de despliegue de otro artefacto de extensión de despliegue. Y si la dependencia de tiempo de ejecución se declara como opcional, entonces la dependencia de despliegue correspondiente también **debe** configurarse como opcional.

source: the deployment extension artifact `quarkus-extension-a-deployment`
es_es: el artefacto de extensión del despliegue `quarkus-extension-a-deployment`

source: declares an optional Maven dependency on the deployment extension artifact `quarkus-extension-b-deployment`
es_es: declara una dependencia opcional de Maven en el artefacto de extensión del despliegue `quarkus-extension-b-deployment`

source: Normally, optional Maven extension dependencies are ignored by the Quarkus dependency resolver at build time. In this case though, the optional dependency `quarkus-extension-b` includes a dependency condition in its extension descriptor, which turns this optional Maven dependency into a Quarkus conditional extension dependency.
es_es: Normalmente, las dependencias opcionales de las extensiones de Maven son ignoradas por el resolvedor de dependencias de Quarkus en tiempo de construcción. Sin embargo, en este caso, la dependencia opcional `quarkus-extension-b` incluye una condición de dependencia en su descriptor de extensión, que convierte esta dependencia opcional de Maven en una dependencia de extensión condicional de Quarkus.

source: If `quarkus-extension-b` wasn't declared as `<optional>true</optional>` that would make `quarkus-extension-b` a required dependency of `quarkus-extension-a` and its dependency condition would be ignored.
es_es: Si `quarkus-extension-b` no fuera declarado como `<optional>true</optional>` eso haría que `quarkus-extension-b` fuera una dependencia requerida de `quarkus-extension-a` y su condición de dependencia sería ignorada.

source: Declaring a conditional dependency in the Quarkus extension descriptor
es_es: Declarar una dependencia condicional en el descriptor de extensión de Quarkus

source: Conditional dependencies can also be configured in the Quarkus extension descriptor. The conditional dependency configured above could be expressed in the extension descriptor of `quarkus-extension-a` as:
es_es: Las dependencias condicionales también pueden configurarse en el descriptor de la extensión de Quarkus. La dependencia condicional configurada anteriormente podría expresarse en el descriptor de extensión de `quarkus-extension-a` como:

source: runtime Quarkus extension artifact ID, in our example `quarkus-extension-a`
es_es: ID del artefacto de extensión de Quarkus en tiempo de ejecución, en nuestro ejemplo `quarkus-extension-a`

source: the goal that generates the extension descriptor which every Quarkus runtime extension project should be configured with
es_es: el objetivo que genera el descriptor de extensión con el que debe configurarse cada proyecto de extensión en tiempo de ejecución de Quarkus

source: conditional dependency configuration element
es_es: elemento de configuración de dependencia condicional

source: artifact coordinates of conditional dependencies on other extensions.
es_es: coordenadas del artefacto de las dependencias condicionales de otras extensiones.

source: In this case, the Maven dependency is not at all required in the `pom.xml`.
es_es: En este caso, la dependencia de Maven no es necesaria en absoluto en la página web `pom.xml`.
