Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_guides/deploying-to-heroku.adoc.po
Languages: to

source: Deploying to Heroku
to: Despliegue en Heroku

source: In this guide you will learn how to deploy a Quarkus based web application as a web-dyno to Heroku.
to: En esta guía aprenderás a desplegar una aplicación web basada en Quarkus como web-dyno en Heroku.

source: This guide covers:
to: Esta guía abarca:

source: Update Quarkus HTTP Port
to: Actualizar el puerto HTTP de Quarkus

source: Install the Heroku CLI
to: Instalar la CLI de Heroku

source: Deploy the application to Heroku
to: Despliegue de la aplicación en Heroku

source: Deploy the application as Docker image to Heroku
to: Desplegar la aplicación como imagen Docker en Heroku

source: Deploy the native application as Docker image to Heroku
to: Desplegar la aplicación nativa como imagen Docker en Heroku

source: Prerequisites
to: Requisitos previos

source: https://www.heroku.com/[A Heroku Account]. Free accounts work.
to: https://www.heroku.com/[Una cuenta de Heroku]. Las cuentas gratuitas funcionan.

source: https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI installed]
to: https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI instalado]

source: Introduction
to: Introducción

source: Heroku can be used in different ways to run a Quarkus application:
to: Heroku se puede utilizar de diferentes maneras para ejecutar una aplicación Quarkus:

source: As a plain Java program running in a container defined by Heroku's environment
to: Como un programa Java simple que se ejecuta en un contenedor definido por el entorno de Heroku

source: As a containerized Java program running in a container defined by the Quarkus build process
to: Como un programa Java en contenedor que se ejecuta en un contenedor definido por el proceso de construcción de Quarkus

source: As a containerized native program running in a container defined by the Quarkus build process
to: Como un programa nativo en contenedor que se ejecuta en un contenedor definido por el proceso de construcción de Quarkus

source: All three approaches need to be aware of the port that Heroku assigns to it to handle traffic. Luckily, there's a dynamic configuration property for it.
to: Los tres enfoques necesitan conocer el puerto que Heroku le asigna para manejar el tráfico. Por suerte, hay una propiedad de configuración dinámica para ello.

source: The guide assumes that you have the https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI] installed.
to: La guía asume que tienes la https://devcenter.heroku.com/articles/heroku-cli[CLI de Heroku] instalada.

source: Common project setup
to: Configuración del proyecto común

source: This guide will take as input an application developed in the xref:getting-started.adoc[Getting Started guide].
to: Esta guía tomará como entrada una aplicación desarrollada en la xref:getting-started.html[guía de inicio].

source: Make sure you have the getting-started application at hand, or clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive]. The solution is located in the `getting-started` directory.
to: Asegúrate de tener a mano la aplicación de inicio, o clona el repositorio Git: `git clone {quickstarts-clone-url}` o descargue un {quickstarts-archive-url}[archivo]. La solución se encuentra en el directorio `getting-started`.

source: Also, make sure your Heroku CLI is working:
to: Además, asegúrate de que tu CLI de Heroku está funcionando:

source: Prepare the Quarkus HTTP Port
to: Preparar el puerto HTTP de Quarkus

source: Heroku picks a random port and assigns it to the container that is eventually running your Quarkus application. That port is available as an environment variable under `$PORT`. The easiest way to make Quarkus in all deployment scenarios aware of it is using the following configuration:
to: Heroku escoge un puerto al azar y lo asigna al contenedor que eventualmente ejecuta tu aplicación Quarkus. Ese puerto está disponible como una variable de entorno en `$PORT`. La forma más fácil de hacer que Quarkus en todos los escenarios de despliegue lo conozca es utilizando la siguiente configuración:

source: This reads as: "Listen on `$PORT` if this is a defined variable, otherwise listen on 8080 as usual." Run the following to add this to your `application.properties`:
to: Esto se lee como: "Escuchar en `$PORT` si esta es una variable definida, de lo contrario escuchar en 8080 como de costumbre". Ejecute lo siguiente para añadir esto a su `application.properties`:

source: Deploy the repository and build on Heroku
to: Desplegar el repositorio y construir en Heroku

source: The first variant uses the Quarkus Maven build to create the _quarkus-app_ application structure containing the runnable "fast-jar" as well as all libraries needed inside Heroku's build infrastructure and then deploying that result, the other one uses a local build process to create an optimized container.
to: La primera variante utiliza la construcción de Quarkus Maven para crear la estructura de la aplicación _quarkus-app_ que contiene el "fast-jar" ejecutable, así como todas las bibliotecas necesarias dentro de la infraestructura de construcción de Heroku y luego desplegar ese resultado, el otro utiliza un proceso de construcción local para crear un contenedor optimizado.

source: Two additional files are needed in your application's root directory:
to: Se necesitan dos archivos adicionales en el directorio raíz de su aplicación:

source: `system.properties` to configure the Java version
to: `system.properties` para configurar la versión de Java

source: `Procfile` to configure how Heroku starts your application
to: `Procfile` para configurar cómo Heroku inicia su aplicación

source: Quarkus needs JDK 11, so we specify that first:
to: Quarkus necesita JDK 11, así que lo especificamos primero:

source: We will deploy a web application so we need to configure the type `web` in the Heroku `Procfile` like this:
to: Vamos a desplegar una aplicación web por lo que necesitamos configurar el tipo `web` en el Heroku `Procfile` así:

source: Your application should already be runnable via `heroku local web`.
to: Su aplicación ya debería poder ejecutarse a través de `heroku local web`.

source: Let's create an application in your account and deploy that repository to it:
to: Vamos a crear una aplicación en tu cuenta y a desplegar ese repositorio en ella:

source: The application will have a generated name and the terminal should output that. `heroku open` opens your default browser to access your new application.
to: La aplicación tendrá un nombre generado y el terminal debería mostrarlo. `heroku open` abre su navegador por defecto para acceder a su nueva aplicación.

source: To access the REST endpoint via curl, run:
to: Para acceder al endpoint REST mediante curl, ejecute:

source: Of course, you can use the Heroku CLI to connect this repo to your GitHub account, too, but this is out of scope for this guide.
to: Por supuesto, también puedes utilizar la CLI de Heroku para conectar este repositorio a tu cuenta de GitHub, pero esto está fuera del alcance de esta guía.

source: Deploy as container
to: Desplegar como contenedor

source: The advantage of pushing a whole container is that we are in complete control over its content and maybe even choose to deploy a container with a native executable running on GraalVM.
to: La ventaja de subir un contenedor completo es que tenemos un control total sobre su contenido y podemos incluso elegir desplegar un contenedor con un ejecutable nativo que se ejecute en GraalVM.

source: First, login to Heroku's container registry:
to: En primer lugar, inicie sesión en el registro de contenedores de Heroku:

source: We need to add an extension to our project to build container images via the Quarkus Maven plugin:
to: Necesitamos añadir una extensión a nuestro proyecto para construir imágenes de contenedores a través del plugin de Quarkus Maven:

source: The image we are going to build needs to be named accordingly to work with Heroku's registry and deployment. We get the generated name via `heroku info` and pass it on to the (local) build:
to: La imagen que vamos a construir necesita ser nombrada en consecuencia para trabajar con el registro y el despliegue de Heroku. Obtenemos el nombre generado a través de `heroku info` y lo pasamos a la construcción (local):

source: With Docker installed, you can now push the image and release it:
to: Con Docker instalado, ahora puedes empujar la imagen y liberarla:

source: You can and should check the logs to see if your application is now indeed running from the container:
to: Puede y debe comprobar los registros para ver si su aplicación se está ejecutando desde el contenedor:

source: The initial push is rather big, as all layers of the image need to be transferred. The following pushes will be smaller.
to: La subida inicial es bastante grande, ya que hay que transferir todas las capas de la imagen. Los siguientes subidas serán más pequeños.

source: The biggest advantage we take when deploying our app as a container is to deploy a container with the natively compiled application. Why? Because Heroku will stop or sleep the application when there's no incoming traffic. A native application will wake up much faster from its sleep.
to: La mayor ventaja que obtenemos al desplegar nuestra aplicación como contenedor es desplegar un contenedor con la aplicación compilada de forma nativa. ¿Por qué? Porque Heroku detendrá o dormirá la aplicación cuando no haya tráfico entrante. Una aplicación nativa se despertará mucho más rápido de su reposo.

source: The process is pretty much the same. We opt in to compiling a native image inside a local container, so that we don't have to deal with installing GraalVM locally:
to: El proceso es prácticamente el mismo. Optamos por compilar una imagen nativa dentro de un contenedor local, para no tener que lidiar con la instalación de GraalVM localmente:

source: After that, push and release again:
to: Después, suba y publique de nuevo:
