Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_guides/getting-started.adoc.po
Languages: es

source: Creating Your First Application
es: Creando su primera aplicación

source: Learn how to create a Hello World Quarkus app. This guide covers:
es: Aprende como crear una aplicación Hello World de Quarkus. Esta guía cubre:

source: Bootstrapping an application
es: Puesta en marcha de una aplicación

source: Injecting beans
es: Inyección de beans

source: Functional tests
es: Pruebas funcionales

source: Packaging of the application
es: Packaging de la aplicación

source: Prerequisites
es: Requisitos previos

source: Verify Maven is using the Java you expect
es: Verifique que Maven está usando el Java que espera

source: Architecture
es: Arquitectura

source: In this guide, we create a straightforward application serving a `hello` endpoint. To demonstrate dependency injection, this endpoint uses a `greeting` bean.
es: En esta guía, creamos una aplicación sencilla que sirve un endpoint de `hello`. Para demostrar la inyección de dependencias, este endpoint utiliza un bean `greeting`.

source: Architecture,
es: Arquitectura,

source: This guide also covers the testing of the endpoint.
es: Esta guía también cubre las pruebas del endpoint.

source: Solution
es: Solución

source: However, you can go right to the completed example.
es: Sin embargo, puede ir directamente al ejemplo completo.

source: Download an {quickstarts-archive-url}[archive] or clone the git repository:
es: Descarga un {quickstarts-archive-url}[archive] o clona el repositorio git:

source: Bootstrapping the project
es: Puesta en marcha del proyecto

source: The easiest way to create a new Quarkus project is to open a terminal and run the following command:
es: La forma más fácil de crear un nuevo proyecto de Quarkus es abrir un terminal y ejecutar el siguiente comando:

source: It generates the following in `./getting-started`:
es: Genera lo siguiente en `./getting-started`:

source: the Maven structure
es: la estructura de Maven

source: an `org.acme.GreetingResource` resource exposed on `/hello`
es: un recurso de `org.acme.GreetingResource` expuesto en `/hello`

source: an associated unit test
es: una prueba unitaria asociada

source: a landing page that is accessible on `http://localhost:8080` after starting the application
es: una página inicial que es accesible en `&lt;a href="http://localhost:8080" class="bare"&gt;http://localhost:8080&lt;/a&gt;` después de iniciar la aplicación

source: example `Dockerfile` files for both `native` and `jvm` modes in `src/main/docker`
es: ejemplo `Dockerfile` archivos para los modos `native` y `jvm` en `src/main/docker`

source: the application configuration file
es: el archivo de configuración de la aplicación

source: Once generated, look at the `pom.xml`. You will find the import of the Quarkus BOM, allowing you to omit the version of the different Quarkus dependencies. In addition, you can see the `quarkus-maven-plugin` responsible of the packaging of the application and also providing the development mode.
es: Una vez generado, mira el `pom.xml`. Encontrarás la importación Quarkus BOM, permitiendo omitir la versión de las diferentes dependencias de Quarkus. Además, se puede ver el `quarkus-maven-plugin` responsable del empaquetado de la aplicación y también proporcionar el modo de desarrollo.

source: In a Gradle project, you would find a similar setup:
es: En un proyecto Gradle, se encontraría una configuración similar:

source: the Quarkus Gradle plugin
es: el plugin Quarkus Gradle

source: an `enforcedPlatform` directive for the Quarkus BOM
es: una directiva `enforcedPlatform` para Quarkus BOM

source: If we focus on the dependencies section, you can see the extension allowing the development of REST applications:
es: Si nos centramos en la sección de dependencias, se puede ver la extensión que permite el desarrollo de aplicaciones REST:

source: During the project creation, the `src/main/java/org/acme/GreetingResource.java` file has been created with the following content:
es: Durante la creación del proyecto, se ha creado el archivo `src/main/java/org/acme/GreetingResource.java` con el siguiente contenido:

source: It's a very simple REST endpoint, returning "Hello from RESTEasy Reactive" to requests on "/hello".
es: Se trata de un endpoint REST muy sencillo, que devuelve "Hello from RESTEasy Reactive" a las peticiones en "/hello".

source: With Quarkus, there is no need to create an `Application` class. It's supported, but not required. In addition, only one instance of the resource is created and not one per request. You can configure this using the different `*Scoped` annotations (`ApplicationScoped`, `RequestScoped`, etc).
es: Con Quarkus, no es necesario crear una clase `Application`. Se admite, pero no se requiere. Además, solo se crea una instancia del recurso y no una por solicitud. Esto se puede configurar utilizando las diferentes anotaciones de `*Scoped` ( `ApplicationScoped`, `RequestScoped`, etc).

source: Running the application
es: Ejecución de la aplicación

source: Now we are ready to run our application:
es: Ahora estamos listos para ejecutar nuestra aplicación:

source: Once started, you can request the provided endpoint:
es: Una vez iniciado, puede usar el endpoint proporcionado:

source: Hit `CTRL+C` to stop the application, or keep it running and enjoy the blazing fast hot-reload.
es: Pulsa `CTRL+C` para detener la aplicación, o mantenla en funcionamiento y disfruta de la rapidísima recarga en caliente.

source: Automatically add newline with `curl -w "\n"`
es: Añadir automáticamente una nueva línea con `curl -w "\n"`

source: We are using `curl -w "\n"` in this example to avoid your terminal printing a '%' or put both result and next command prompt on the same line.
es: En este ejemplo utilizamos `curl -w "\n"` para evitar que su terminal imprima un '%' o ponga el resultado y el siguiente comando en la misma línea.

source: Using injection
es: Uso de la inyección

source: Dependency injection in Quarkus is based on ArC which is a CDI-based dependency injection solution tailored for Quarkus' architecture. If you're new to CDI then we recommend you to read the xref:cdi.adoc[Introduction to CDI] guide.
es: La inyección de dependencias en Quarkus se basa en ArC, que es una solución de inyección de dependencias basada en CDI y adaptada a la arquitectura de Quarkus. Si eres nuevo en CDI, te recomendamos que leas la guía de xref:cdi.adoc[Introducción a CDI].

source: Quarkus only implements a subset of the CDI features and comes with non-standard features and specific APIS, you can learn more about it in the xref:cdi-reference.adoc[Contexts and Dependency Injection guide].
es: Quarkus sólo implementa un subconjunto de las características de CDI y viene con características no estándar y APIS específicas, puedes aprender más sobre esto en la xref:cdi-reference.adoc[Guía de contextos e inyección de dependencias].

source: ArC comes as a dependency of `quarkus-resteasy-reactive` so you already have it handy.
es: ArC viene como una dependencia de `quarkus-resteasy-reactive` por lo que ya lo tienes a mano.

source: Let's modify the application and add a companion bean. Create the `src/main/java/org/acme/GreetingService.java` file with the following content:
es: Vamos a modificar la aplicación y a añadir un bean de acompañamiento. Crea el archivo `src/main/java/org/acme/GreetingService.java` con el siguiente contenido:

source: Edit the `GreetingResource` class to inject the `GreetingService` and create a new endpoint using it:
es: Edite la clase `GreetingResource` para inyectar el `GreetingService` y cree un nuevo punto final utilizándolo:

source: If you stopped the application (keep in mind you don't have to do it, changes will be automatically deployed by our live reload feature), restart the application with:
es: Si has detenido la aplicación (ten en cuenta que no tienes que hacerlo, los cambios se desplegarán automáticamente por nuestra función de recarga en vivo), reinicia la aplicación con:

source: Then check that the endpoint returns `hello quarkus` as expected:
es: A continuación, compruebe que el endpoint devuelve `hello quarkus` como se esperaba:

source: Development Mode
es: Modo de desarrollo

source: `quarkus:dev` runs Quarkus in development mode. This enables live reload with background compilation, which means that when you modify your Java files and/or your resource files and refresh your browser, these changes will automatically take effect. This works too for resource files like the configuration property file. Refreshing the browser triggers a scan of the workspace, and if any changes are detected, the Java files are recompiled and the application is redeployed; your request is then serviced by the redeployed application. If there are any issues with compilation or deployment an error page will let you know.
es: `quarkus:dev` ejecuta Quarkus en modo de desarrollo. Esto permite la recarga en vivo con compilación en segundo plano, lo que significa que cuando se modifican los archivos Java y/o los archivos de recursos y se actualiza el navegador, estos cambios tendrán efecto automáticamente. Esto funciona también para los archivos de recursos como el archivo de propiedades de configuración. Al actualizar el navegador, se realiza un análisis del área de trabajo y, si se detecta algún cambio, se recopilaran los archivos Java y se vuelve a desplegar la aplicación; la solicitud se atiende entonces con la aplicación re-desplegada. Si hay algún problema con la compilación o el despliegue, una página de error le informará.

source: This will also listen for a debugger on port `5005`. If you want to wait for the debugger to attach before running you can pass `-Dsuspend` on the command line. If you don't want the debugger at all you can use `-Ddebug=false`.
es: Esto también c un depurador en el puerto `5005`. Si quieres esperar a que el depurador se conecte antes de ejecutarlo puedes pasar `-Dsuspend` en la línea de comandos. Si no quieres el depurador en absoluto puedes usar `-Ddebug=false`.

source: Testing
es: Probando

source: All right, so far so good, but wouldn't it be better with a few tests, just in case.
es: De acuerdo, hasta aquí todo bien, pero no sería mejor con unas cuantas pruebas, por si acaso.

source: In the generated build file, you can see 2 test dependencies:
es: En el archivo de construcción generado, puede ver 2 dependencias de prueba:

source: Quarkus supports https://junit.org/junit5/[JUnit 5] tests.
es: Quarkus es compatible con las pruebas de https://junit.org/junit5/[JUnit 5].

source: Because of this, in the case of Maven, the version of the https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] must be set, as the default version does not support JUnit 5:
es: Debido a esto, en el caso de Maven, se debe establecer la versión del https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin], ya que la versión por defecto no soporta JUnit 5:

source: We also set the `java.util.logging` system property to make sure tests will use the correct log manager and `maven.home` to ensure that custom configuration from `${maven.home}/conf/settings.xml` is applied (if any).
es: También establecemos la propiedad del sistema `java.util.logging` para asegurarnos de que las pruebas utilizarán el gestor de registros correcto y `maven.home` para asegurarnos de que se aplica la configuración personalizada de `${maven.home}/conf/settings.xml` (si la hay).

source: The generated project contains a simple test. Edit the `src/test/java/org/acme/GreetingResourceTest.java` to match the following content:
es: El proyecto generado contiene una prueba sencilla. Edite el `src/test/java/org/acme/GreetingResourceTest.java` para que coincida con el siguiente contenido:

source: By using the `QuarkusTest` runner, you instruct JUnit to start the application before the tests.
es: Utilizando el runner `QuarkusTest`, se indica a JUnit que inicie la aplicación antes que las pruebas.

source: Check the HTTP response status code and content
es: Compruebe el código de estado de la respuesta HTTP y el contenido

source: You can run these using Maven:
es: Puedes ejecutarlas con Maven:

source: You can also run the test from your IDE directly (be sure you stopped the application first).
es: También puede ejecutar la prueba desde su IDE directamente (asegúrese de detener la aplicación primero).

source: By default, tests will run on port `8081` so as not to conflict with the running application. We automatically configure RestAssured to use this port. If you want to use a different client you should use the `@TestHTTPResource` annotation to directly inject the URL of the tested application into a field on the test class. This field can be of the type `String`, `URL` or `URI`. This annotation can also be given a value for the test path. For example, if I want to test a Servlet mapped to `/myservlet` I would just add the following to my test:
es: Por defecto, las pruebas se ejecutarán en el puerto `8081` para no entrar en conflicto con la aplicación en ejecución. Configuramos automáticamente RestAssured para utilizar este puerto. Si desea utilizar un cliente diferente, deberá utilizar la anotación `@TestHTTPResource` para inyectar directamente la URL de la aplicación probada en un campo de la clase de prueba. Este campo puede ser del tipo `String`, `URL` o `URI`. A esta anotación también se le puede dar un valor para la ruta de prueba. Por ejemplo, si quiero probar un Servlet mapeado en `/myservlet` sólo tendría que añadir lo siguiente a mi prueba:

source: The test port can be controlled via the `quarkus.http.test-port` config property. Quarkus also creates a system property called `test.url` that is set to the base test URL for situations where you cannot use injection.
es: El puerto de prueba puede ser controlado a través de la propiedad de configuración `quarkus.http.test-port`. Quarkus también crea una propiedad del sistema llamada `test.url` que se establece en la URL de prueba base para situaciones en las que no se puede utilizar la inyección.

source: Working with multi-module project or external modules
es: Trabajar con un proyecto multimodal o con módulos externos

source: Quarkus heavily utilizes https://github.com/wildfly/jandex[Jandex] at build time, to discover various classes or annotations. One immediately recognizable application of this, is CDI bean discovery. As a result, most of the Quarkus extensions will not work properly if this build time discovery isn't properly setup.
es: Quarkus utiliza en gran medida https://github.com/wildfly/jandex[Jandex] en tiempo de construcción, para descubrir varias clases o anotaciones. Una aplicación inmediatamente reconocible de esto, es el descubrimiento de bean CDI. Como resultado, la mayoría de las extensiones de Quarkus no funcionarán correctamente si este descubrimiento en tiempo de construcción no está configurado correctamente.

source: This index is created by default on the project on which Quarkus is configured for, thanks to our Maven and Gradle plugins.
es: Este índice se crea por defecto en el proyecto en el que se configura Quarkus, gracias a nuestros plugins de Maven y Gradle.

source: However, when working with a multi-module project, be sure to read the `Working with multi-module projects` section of the xref:maven-tooling.adoc#multi-module-maven[Maven] or xref:gradle-tooling.adoc#multi-module-maven[Gradle] guides.
es: Sin embargo, cuando trabajes con un proyecto multimódulo, asegúrate de leer la sección `Working with multi-module projects` de las guías de xref:maven-tooling.adoc#multi-module-maven[Maven] o xref:gradle-tooling.adoc#multi-module-maven[Gradle].

source: If you plan to use external modules (for example, an external library for all your domain objects), you will need to make these modules known to the indexing process either by adding the Jandex plugin (if you can modify them) or via the `quarkus.index-dependency` property inside your `application.properties` (useful in cases where you can't modify the module).
es: Si tiene previsto utilizar módulos externos (por ejemplo, una biblioteca externa para todos sus objetos de dominio), tendrá que dar a conocer estos módulos al proceso de indexación, ya sea añadiendo el plugin de Jandex (si puede modificarlos) o a través de la propiedad `quarkus.index-dependency` dentro de su `application.properties` (útil en los casos en que no pueda modificar el módulo).

source: Be sure to read the xref:cdi-reference.adoc#bean_discovery[Bean Discovery] section of the CDI guide for more information.
es: Asegúrese de leer la sección de xref:cdi-reference.adoc#bean_discovery[Bean Discovery] de la guía CDI para obtener más información.

source: Packaging and run the application
es: Empaquetar y ejecutar la aplicación

source: The application is packaged using:
es: La aplicación se empaqueta con:

source: It produces several outputs in `/target`:
es: Produce varias salidas en `/target`:

source: `getting-started-1.0.0-SNAPSHOT.jar` - containing just the classes and resources of the projects, it's the regular artifact produced by the Maven build - it is *not* the runnable jar;
es: `getting-started-1.0.0-SNAPSHOT.jar` - que contiene sólo las clases y recursos de los proyectos, es el artefacto regular producido por la construcción de Maven - *no* es el jar ejecutable;

source: the `quarkus-app` directory which contains the `quarkus-run.jar` jar file - being an executable _jar_. Be aware that it's not an _über-jar_ as the dependencies are copied into subdirectories of `quarkus-app/lib/`.
es: el directorio `quarkus-app` que contiene el archivo jar `quarkus-run.jar` - siendo un _jar_ ejecutable. Tenga en cuenta que no es un _über-jar_ ya que las dependencias se copian en subdirectorios de `quarkus-app/lib/`.

source: You can run the application using: `java -jar target/quarkus-app/quarkus-run.jar`
es: Puedes ejecutar la aplicación con: `java -jar target/quarkus-app/quarkus-run.jar`

source: If you want to deploy your application somewhere (typically in a container), you need to deploy the whole `quarkus-app` directory.
es: Si quieres desplegar tu aplicación en algún lugar (normalmente en un contenedor), necesitas desplegar todo el directorio `quarkus-app`.

source: Before running the application, don't forget to stop the hot reload mode (hit `CTRL+C`), or you will have a port conflict.
es: Antes de ejecutar la aplicación, no olvides detener el modo de recarga en caliente (pulsa `CTRL+C`), o tendrás un conflicto de puertos.

source: Configuring the banner
es: Configuración del banner

source: What's next?
es: ¿Qué es lo que sigue?

source: In addition, the xref:tooling.adoc[tooling guide] document explains how to:
es: Además, el documento xref:tooling.adoc[Guía de herramientas] explica cómo:

source: scaffold a project in a single command line
es: armar un proyecto en una sola línea de comandos

source: enable the _development mode_ (hot reload)
es: activar el _modo de desarrollo_ (recarga en caliente)

source: import the project in your favorite IDE
es: importar el proyecto en su IDE favorito

source: and more
es: y más
