Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_guides/grpc-kubernetes.adoc.po
Languages: es

source: Deploying your gRPC Service in Kubernetes
es: Despliegue de su servicio gRPC en Kubernetes

source: This page explains how to deploy your gRPC service in Quarkus in Kubernetes. We'll continue with the example from xref:grpc-getting-started.adoc[the Getting Started gRPC guide].
es: Esta página explica cómo desplegar su servicio gRPC en Quarkus en Kubernetes. Continuaremos con el ejemplo de xref:grpc-getting-started.adoc[la guía Getting Started gRPC].

source: Configuring your project to use the Quarkus Kubernetes extension
es: Configuración de su proyecto para utilizar la extensión Quarkus Kubernetes

source: Add the Quarkus Kubernetes extension to your build file:
es: Añade la extensión Quarkus Kubernetes a tu archivo de compilación:

source: Next, we want to expose our application using the Kubernetes Ingress resource:
es: A continuación, queremos exponer nuestra aplicación utilizando el recurso Kubernetes Ingress:

source: The Quarkus Kubernetes will bind the HTTP server using the port name `http` and the gRPC server using the port name `grpc`. By default, the Quarkus application will only expose the port name `http`, so only the HTTP server will be publicly accessible. To expose the gRPC server instead, set the `quarkus.kubernetes.ingress.target-port=grpc` property in your application.properties:
es: Quarkus Kubernetes enlazará el servidor HTTP utilizando el nombre de puerto `http` y el servidor gRPC utilizando el nombre de puerto `grpc`. Por defecto, la aplicación Quarkus sólo expondrá el nombre de puerto `http`, por lo que sólo el servidor HTTP será accesible públicamente. Para exponer el servidor gRPC en su lugar, establezca la propiedad `quarkus.kubernetes.ingress.target-port=grpc` en su application.properties:

source: If you configure Quarkus to use the same port for both HTTP and gRPC servers with the property `quarkus.grpc.server.use-separate-server=false`, then you don't need to change the default `target-port`.
es: Si configuras Quarkus para usar el mismo puerto para ambos servidores HTTP y gRPC con la propiedad `quarkus.grpc.server.use-separate-server=false`, entonces no necesitas cambiar el valor por defecto `target-port`.

source: Finally, we need to generate the Kubernetes manifests by running the command in a terminal:
es: Por último, tenemos que generar los manifiestos de Kubernetes ejecutando el comando en un terminal:

source: Once generated, you can look at the `target/kubernetes` directory:
es: Una vez generado, puede consultar el directorio `target/kubernetes`:

source: You can find more information about how to deploy the application in Kubernetes in the xref:deploying-to-kubernetes.adoc#deployment[the Kubernetes guide].
es: Puede encontrar más información sobre cómo desplegar la aplicación en Kubernetes en xref:deploying-to-kubernetes.adoc#deployment[la guía de Kubernetes].

source: Using gRPC Health probes
es: Uso de las sondas gRPC Health

source: By default, the Kubernetes resources do not contain readiness and liveness probes. To add them, import the Smallrye Health extension to your build file:
es: Por defecto, los recursos de Kubernetes no contienen sondas de disponibilidad y liveness. Para añadirlas, importe la extensión Smallrye Health a su archivo de compilación:

source: More information about the health extension can be found in xref:microprofile-health.adoc[the Microprofile Health guide].
es: Encontrará más información sobre la extensión de salud en xref:microprofile-health.adoc[la guía Salud del Microperfil].

source: By the default, this extension will configure the probes to use the HTTP server (which is provided by some extensions like the Quarkus RESTEasy reactive extension). Internally, this probe will also use xref:grpc-service-implementation.adoc#health[the generated gRPC Health services].
es: Por defecto, esta extensión configurará las sondas para utilizar el servidor HTTP (que es proporcionado por algunas extensiones como la extensión reactiva RESTEasy de Quarkus). Internamente, esta sonda también utilizará xref:grpc-service-implementation.adoc#health[los servicios gRPC Health generados].

source: If your application does not use any Quarkus extension that exposes an HTTP server, you can still configure the probes to directly use the gRPC Health service by adding the property `quarkus.kubernetes.readiness-probe.grpc-action-enabled=true` into your configuration:
es: Si su aplicación no utiliza ninguna extensión de Quarkus que exponga un servidor HTTP, aún puede configurar las sondas para que utilicen directamente el servicio gRPC Health añadiendo la propiedad `quarkus.kubernetes.readiness-probe.grpc-action-enabled=true` en su configuración:
