Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_guides/ide-tooling.adoc.po
Languages: es

source: Quarkus Tools in your favorite IDE
es: Herramientas Quarkus en su IDE favorito

source: The following IDEs have support for the community developed Quarkus Tools:
es: Los siguientes IDEs tienen soporte para las herramientas Quarkus desarrolladas por la comunidad:

source: https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[Quarkus Tools for Visual Studio Code]
es: https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[Herramientas Quarkus para Visual Studio Code]

source: https://marketplace.eclipse.org/content/quarkus-tools[Quarkus Tools for Eclipse]
es: https://marketplace.eclipse.org/content/quarkus-tools[Herramientas Quarkus para Eclipse]

source: The table below gives an overview of the current IDEs with links and a high-level overview of their features.
es: La siguiente tabla ofrece una visión general de los IDEs actuales con enlaces y una visión general de sus características.

source: image:{vscode-logo}[VSCode,100,100] {empty} + VSCode Quarkus Tools
es: image:{vscode-logo}[VSCode,100,100] {empty} + Herramientas VSCode Quarkus

source: image:{eclipse-logo}[Eclipse,100,100] {empty} + Eclipse Quarkus Tools
es: image:{eclipse-logo}[Eclipse,100,100] {empty} + Herramientas Eclipse Quarkus

source: image:{intellij-logo}[IntelliJ,100,100] {empty} + IntelliJ Quarkus Tools
es: image:{intellij-logo}[IntelliJ,100,100] {empty} + Herramientas IntelliJ Quarkus

source: Description
es: Descripción

source: Visual Studio Code extension to install using the marketplace
es: Extensión de Visual Studio Code para instalar mediante el marketplace

source: Built-in Quarkus features available in Eclipse Che incl. che.openshift.io.
es: Características incorporadas de Quarkus disponibles en Eclipse Che incl. che.openshift.io.

source: Status
es: Estatus

source: Stable
es: Estable

source: Downloads
es: Descargas

source: https://download.jboss.org/jbosstools/photon/snapshots/builds/jbosstools-quarkus_master/[Development Update Site]
es: https://download.jboss.org/jbosstools/photon/snapshots/builds/jbosstools-quarkus_master/[Sitio de actualización del desarrollo]

source: https://www.jetbrains.com/idea/nextversion/[Installer]
es: https://www.jetbrains.com/idea/nextversion/[Instalador]

source: https://che.openshift.io/f?url=https://raw.githubusercontent.com/redhat-developer/devfile/master/getting-started/quarkus/devfile.yaml[Start Che Workspace]
es: https://che.openshift.io/f?url=https://raw.githubusercontent.com/redhat-developer/devfile/master/getting-started/quarkus/devfile.yaml[Iniciar el espacio de trabajo de Che]

source: Source
es: Fuente

source: Closed-Source
es: Fuente cerrada

source: https://github.com/redhat-developer/quarkus-ls[Quarkus Language Server]
es: https://github.com/redhat-developer/quarkus-ls[Servidor de idiomas Quarkus]

source: Wizards w/code.quarkus.io
es: Hechiceros w/code.quarkus.io

source: Custom Wizard
es: Asistente personalizado

source: Config editor
es: Editor de configuración

source: Config autocompletion
es: Configurar el autocompletado

source: Config validation
es: Validación de la configuración

source: Config jump to definition
es: Salto de configuración a la definición

source: Config profiles
es: Perfiles de configuración

source: Config outline
es: Esquema de configuración

source: Quarkus Code Snippets
es: Fragmentos de código de Quarkus

source: Injection Discovery/Navigation
es: Descubrimiento/navegación de la inyección
