Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_guides/kogito-dev-services-build-time-config.adoc.po
Languages: es_es

source: icon:lock[title=Fixed at build time] Configuration property fixed at build time - All other configuration properties are overridable at runtime
es_es: icon:lock[title=Fixed at build time] Propiedad de configuración fijada en tiempo de construcción - Todas las demás propiedades de configuración son anulables en tiempo de ejecución

source: [[quarkus-kogito-dev-services-build-time-config_configuration]]link:#quarkus-kogito-dev-services-build-time-config_configuration[Configuration property]
es_es: [[quarkus-kogito-dev-services-build-time-config_configuration]]link:#quarkus-kogito-dev-services-build-time-config_configuration[Propiedad de configuración]

source: Type
es_es: Tipo

source: Default
es_es: Por defecto

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.enabled]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.enabled[quarkus.kogito.devservices.enabled]` [.description] -- If DevServices has been explicitly enabled or disabled. DevServices is generally enabled by default, unless there is an existing configuration present. When DevServices is enabled Quarkus will attempt to automatically configure and start a Data Index when running in Dev mode. --
es_es: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.enabled]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.enabled[quarkus.kogito.devservices.enabled]` [.description] -- Si DevServices ha sido explícitamente habilitado o deshabilitado. DevServices generalmente está habilitado por defecto, a menos que haya una configuración existente. Cuando DevServices está habilitado, Quarkus intentará configurar e iniciar automáticamente un índice de datos cuando se ejecute en modo Dev. --

source: boolean
es_es: booleano

source: true
es_es: verdadero

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.image-name]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.image-name[quarkus.kogito.devservices.image-name]` [.description] -- The container image name to use. --
es_es: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.image-name]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.image-name[quarkus.kogito.devservices.image-name]` [.description] -- El nombre de la imagen del contenedor a utilizar. --

source: string
es_es: cadena

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.port]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.port[quarkus.kogito.devservices.port]` [.description] -- Optional fixed port the dev service will listen to. If not defined, the port will be chosen randomly. --
es_es: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.port]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.port[quarkus.kogito.devservices.port]` [.description] -- Puerto fijo opcional en el que escuchará el servicio de desarrollo. Si no se define, el puerto se elegirá aleatoriamente. --

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared[quarkus.kogito.devservices.shared]` [.description] -- Indicates if the Data Index instance managed by Quarkus Dev Services is shared. When shared, Quarkus looks for running containers using label-based service discovery. If a matching container is found, it is used, and so a second one is not started. Otherwise, Dev Services for Kogito starts a new container. The discovery uses the `kogito-dev-service-data-index` label. The value is configured using the service-name property. Container sharing is only used in dev mode. --
es_es: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared[quarkus.kogito.devservices.shared]` [.description] -- Indica si la instancia de Data Index gestionada por Quarkus Dev Services es compartida. Cuando se comparte, Quarkus busca contenedores en ejecución utilizando el descubrimiento de servicios basado en etiquetas. Si se encuentra un contenedor que coincida, se utiliza, por lo que no se inicia un segundo. En caso contrario, Dev Services for Kogito inicia un nuevo contenedor. El descubrimiento utiliza la etiqueta `kogito-dev-service-data-index`. El valor se configura mediante la propiedad service-name. La compartición de contenedores sólo se utiliza en el modo dev. --
