Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_guides/security-basic-authentication-howto.adoc.po
Languages: es

source: Enable Basic authentication
es: Activar la autenticación básica

source: Enable xref:security-basic-authentication.adoc[Basic authentication] for your Quarkus project and allow users to authenticate with a username and password.
es: Habilite la autenticación básica para su proyecto Quarkus y permita que los usuarios se autentiquen con un nombre de usuario y una contraseña.

source: Prerequisites
es: Requisitos previos

source: You have installed at least one extension that provides an `IdentityProvider` based on username and password, such as xref:security-jdbc.adoc[Elytron JDBC].
es: Ha instalado al menos una extensión que proporciona un `IdentityProvider` basado en nombre de usuario y contraseña, como xref:security-jdbc.adoc[Elytron JDBC].

source: Procedure
es: Procedimiento

source: Enable Basic authentication by setting the `quarkus.http.auth.basic` property to `true`.
es: Habilite la autenticación básica estableciendo el valor de la propiedad `quarkus.http.auth.basic` en `true`.

source: For testing purposes, you can configure the required user credentials, user name, secret, and roles, in the `application.properties` file. For example:
es: Para fines de prueba, puede configurar las credenciales de usuario, el nombre de usuario, el secreto y las funciones requeridas en el archivo `application.properties`. Por ejemplo:

source: The user, `alice`, has `alice` as their password and `admin` as their role.
es: El usuario, `alice`, tiene como contraseña `alice` y como rol `admin`.

source: The user, `bob`, has `bob` as their password and `user` as their role.
es: El usuario, `bob`, tiene como contraseña `bob` y como rol `user`.

source: For information about other methods that you can use to configure the required user credentials, see the xref:security-testing.adoc#configuring-user-information[Configuring User Information] section of the Quarkus "Security Testing" guide.
es: Para obtener información sobre otros métodos que puede utilizar para configurar las credenciales de usuario requeridas, consulte la sección xref:security-testing.adoc#configuring-user-information[Configuración de información de usuario] de la guía "Pruebas de seguridad" de Quarkus.

source: Configuring user names, secrets, and roles in the `application.properties` file is only suitable for testing scenarios. If you are securing a production application, always use a database to store this information.
es: Configurar nombres de usuario, secretos y roles en el archivo `application.properties` sólo es adecuado para escenarios de prueba. Si estás asegurando una aplicación para producción, utiliza siempre una base de datos para almacenar esta información.

source: Next steps
es: Próximos pasos

source: For a more detailed walk-through that shows you how to configure Basic authentication together with Jakarta Persistence for storing user credentials in a database, see the xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication and Jakarta Persistence] guide.
es: Para obtener un tutorial más detallado que muestra cómo configurar la autenticación básica junto con Jakarta Persistence para almacenar las credenciales de usuario en una base de datos, consulte xref:security-basic-authentication-tutorial.adoc[Asegure una aplicación Quarkus con autenticación básica y Jakarta Guía de persistencia.

source: References
es: Referencias

source: xref:security-overview.adoc[Quarkus Security overview]
es: xref:security-overview.adoc[Visión general de Quarkus Security]

source: xref:security-identity-providers.adoc[Identity Providers]
es: xref:security-identity-providers.adoc[Proveedores de identidad]

source: xref:security-testing.adoc#configuring-user-information[Configuring User Information in application.properties]
es: xref:security-testing.adoc#configuring-user-information[Configuración de la información de usuario en application.properties]

source: xref:security-basic-authentication.adoc[Basic authentication]
es: xref:security-basic-authentication.adoc[Autenticación básica]
