Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_guides/update-to-quarkus-3.adoc.po
Languages: es_es

source: Update projects to Quarkus 3.x automatically
es_es: Actualizar automáticamente los proyectos a Quarkus 3.x

source: You can update your projects from Quarkus 2.x to Quarkus 3.x by running an update command.
es_es: Puede actualizar sus proyectos de Quarkus 2.x a Quarkus 3.x ejecutando un comando de actualización.

source: The update command primarily uses OpenRewrite recipes to automate updating most of your project's dependencies, source code, and documentation. These recipes cover many but not all of the items described in the link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0[Migration Guide 3.0].
es_es: El comando update utiliza principalmente OpenRewrite para automatizar la actualización de la mayoría de las dependencias, código fuente y documentación de su proyecto. Estas recetas cubren muchos pero no todos los elementos descritos en link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0[Guía de migración 3.0].

source: After updating the project, if you do not find all the updates you expect, there are two possible reasons:
es_es: Si después de actualizar el proyecto no encuentras todas las actualizaciones que esperabas, hay dos posibles razones:

source: The recipe might not cover an item in your project.
es_es: Puede que no cubra un elemento de su proyecto.

source: Your project might use an extension that does not support Quarkus 3 yet.
es_es: Es posible que tu proyecto utilice una extensión que todavía no es compatible con Quarkus 3.

source: In either case, https://github.com/quarkusio/quarkus/issues[let us know by filing an issue] so we can improve the update command.
es_es: En cualquier caso, link:https://github.com/quarkusio/quarkus/issues[comunícalo creando una incidencia] para que podamos mejorar el comando de actualización.

source: If your project uses Hibernate ORM or Hibernate Reactive, read through the link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[Hibernate ORM 5 to 6 migration] quick reference. The following update command only covers a few items in this quick reference.
es_es: Si su proyecto utiliza Hibernate ORM o Hibernate Reactive, lea la referencia rápida de link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[migración de Hibernate ORM 5 a 6]. El siguiente comando de actualización solo cubre algunos elementos de esta referencia rápida.

source: Prerequisites
es_es: Requisitos previos

source: Procedure
es_es: Procedimiento

source: Use your version control system to create a working branch for your project or projects.
es_es: Utiliza tu sistema de control de versiones para crear una rama de trabajo para tu proyecto o proyectos.

source: Optional: To use the Quarkus CLI in the next step, link:https://quarkus.io/guides/cli-tooling#installing-the-cli[install version 3 of the Quarkus CLI]. Use `quarkus -v` to verify the version number.
es_es: Opcional: Para utilizar la CLI de Quarkus en el siguiente paso, link: https://quarkus.io/guides/cli-tooling#installing-the-cli[instalar la versión 3 de la CLI de Quarkus]. Utilice `quarkus -v` para verificar el número de versión.

source: Update the project:
es_es: Actualiza el proyecto:

source: Review the output from the update command for potential instructions and, if needed, perform the indicated tasks.
es_es: Revise la salida del comando de actualización en busca de posibles instrucciones y, si es necesario, realice las tareas indicadas.

source: Review all the changes using a diff tool.
es_es: Revise todos los cambios utilizando una herramienta de diferencias.

source: Review link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0[the migration guide] for any items not covered by the upgrade command and perform additional steps, if needed.
es_es: Revise link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0[la guía de migración] para cualquier elemento no cubierto por el comando de actualización y realice pasos adicionales, si es necesario.

source: Verify that the project builds without errors and that the application passes all tests and works as expected before releasing it to production.
es_es: Compruebe que el proyecto se compila sin errores y que la aplicación supera todas las pruebas y funciona como se espera antes de pasarla a producción.
