Repository: daemonsoft/es.quarkus.io
Catalog: l10n/po/*/_versions/3.20/guides/security-oidc-configuration-properties-reference.adoc.po
Languages: es_es

source: OpenID Connect (OIDC) configuration properties
es_es: Propiedades de configuración de OpenID Connect (OIDC)

source: As a Quarkus developer, you configure the Quarkus OpenID Connect (OIDC) extension by setting the following properties in the `src/main/resources/application.properties` file.
es_es: Como desarrollador de Quarkus, usted configura la extensión OpenID Connect (OIDC) de Quarkus estableciendo las siguientes propiedades en el archivo `src/main/resources/application.properties`.

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
es_es: <span class="icon"><i class="fa fa-lock" title="Fijado en tiempo de compilación"></i></span> Propiedad de configuración fijada en tiempo de compilación - Todas las demás propiedades de configuración son anulables en tiempo de ejecución <input type="search" id="config-search-0" placeholder="CONFIGURACIÓN DEL FILTRO" disabled>

source: References
es_es: Referencias

source: xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication]
es_es: xref:security-oidc-bearer-token-authentication.adoc[Autenticación del portador OIDC]

source: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Protect a service application by using OpenID Connect (OIDC) Bearer token authentication]
es_es: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Proteger una aplicación de servicio mediante la autenticación de portador OpenID Connect (OIDC)]

source: xref:security-openid-connect-client-reference.adoc[OpenID Connect and OAuth2 Client and Filters Reference Guide]
es_es: xref:security-openid-connect-client-reference.adoc[Guía de referencia del cliente y los filtros de OpenID Connect y OAuth2]

source: xref:security-authentication-mechanisms.adoc#oidc-jwt-oauth2-comparison[Choosing between OpenID Connect, SmallRye JWT, and OAuth2 authentication mechanisms]
es_es: xref:security-authentication-mechanisms.adoc#oidc-jwt-oauth2-comparison[Elegir entre los mecanismos de autenticación OpenID Connect, SmallRye JWT y OAuth2]

source: xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[Combining authentication mechanisms]
es_es: xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[Combinación de mecanismos de autenticación]

source: xref:security-overview.adoc[Quarkus Security]
es_es: xref:security-overview.adoc[Quarkus Seguridad]
